2021-2022/Programming Level Up/week-2/lecture.org

#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t
#+options: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:t e:t email:nil
#+options: f:t inline:t num:t p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t
#+title: Programming Level-up
#+SUBTITLE: Lecture 2 - More advanced Python & Classes
#+date: 2021-10-01
#+author: Jay Morgan
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 27.1 (Org mode 9.4.6)
#+cite_export:

#+startup: beamer
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [10pt]
#+BEAMER_FRAME_LEVEL: 2
#+BEAMER_THEME: Berkeley
#+LATEX_HEADER: \setlength{\parskip}{5pt}
#+LATEX_HEADER: \newcommand{\footnoteframe}[1]{\footnote[frame]{#1}}
#+LaTeX_HEADER: \addtobeamertemplate{footnote}{}{\vspace{2ex}}
#+LATEX_HEADER: \usepackage{tabularx}

#+PROPERTY: header-args:python :results pp output :session :exports both :eval never-export :post commentify(*this*)

#+name: commentify
#+begin_src emacs-lisp :var result="" :exports none
(with-output-to-string
  (princ "Results: \n")
  (dolist (result-item (split-string result "\n"))
    (princ (concat "# => " (format "%s\n" result-item)))))
#+end_src

#+begin_src emacs-lisp :exports none
(setq org-latex-minted-options
      '(("frame" "lines")
	("linenos=true")
	("firstnumber=last")
	("fontsize=\\footnotesize")
	("xleftmargin=15pt")
	("numbersep=8pt")))
#+end_src

#+RESULTS:
| frame                  | lines |
| linenos=true           |       |
| firstnumber=last       |       |
| fontsize=\footnotesize |       |
| xleftmargin=15pt       |       |
| numbersep=8pt          |       |

* Proxy

** Univ-tln proxy

*** Setting up a proxy in Linux -- environment variables

Environment variables are variables that are set in the Linux environment and are
used to configure some high-level details in Linux.

The command to create/set an environment is:

#+begin_src
export VARIABLE_NAME=""
#+end_src

Exporting a variable in this way will mean =VARIABLE_NAME= will be accessible while
you're logged in. Every time you log in you will have to set this variable again.

*** Setting up a proxy in Linux -- univ-tln specific

In the université de Toulon, you're required to use the university's proxy server to
access the internet. Therefore, in Linux at least, you will have to tell the system
where the proxy server is with an environment variable.

#+begin_src bash
export HTTP_PROXY='<username>:<password>@proxy.univ-tln.fr:3128'
export HTTPS_PROXY='<username>:<password>@proxy.univ-tln.fr:3128'
export FTP_PROXY='<username>:<password>@proxy.univ-tln.fr:3128'
#+end_src

*** Setting up a proxy in the .bashrc

If you don't wish to set the variable every time log in, you should enter the same
commands into a =.bashrc= in your home directory.

#+begin_src bash
export HTTP_PROXY='...'
export HTTPS_PROXY='...'
export FTP_PROXY='...'
#+end_src

#+RESULTS:

When you log in, the =.bashrc= file will be run and these variables will be set for you.

