2022-2023/Programming Level-up/week-2/lecture.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-12 ven. 10:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Programming Level-up</title>
<meta name="author" content="Jay Morgan" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Programming Level-up
<br />
<span class="subtitle">Lecture 2 - More advanced Python &amp; Classes</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org17868d1">1. Proxy</a>
<ul>
<li><a href="#orgcc36e7b">1.1. Univ-tln proxy</a>
<ul>
<li><a href="#org1736c34">1.1.1. Setting up a proxy in Linux &#x2013; environment variables</a></li>
<li><a href="#orgfbc7212">1.1.2. Setting up a proxy in Linux &#x2013; univ-tln specific</a></li>
<li><a href="#org24d1595">1.1.3. Setting up a proxy in the .bashrc</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org94fde6f">2. Advanced syntax</a>
<ul>
<li><a href="#org4272fae">2.1. List comprehensions</a>
<ul>
<li><a href="#orgaed9718">2.1.1. List comprehensions</a></li>
<li><a href="#org80a3b51">2.1.2. List comprehensions &#x2013; syntax</a></li>
<li><a href="#orgd0e0af5">2.1.3. List comprehensions &#x2013; dictionary</a></li>
<li><a href="#org53c22a7">2.1.4. List comprehensions &#x2013; using <code>if</code>'s</a></li>
<li><a href="#org0042848">2.1.5. List comprehension &#x2013; using <code>if</code>'s</a></li>
<li><a href="#orgb932dbe">2.1.6. List comprehensions &#x2013; multiple <code>for</code>'s</a></li>
<li><a href="#orgde06d3c">2.1.7. Quick Exercise &#x2013; List comprehension</a></li>
</ul>
</li>
<li><a href="#orgd0617c7">2.2. Exceptions</a>
<ul>
<li><a href="#org21d6063">2.2.1. Dealing with Errors</a></li>
<li><a href="#orgdb36bb4">2.2.2. Try-catch</a></li>
<li><a href="#orga072c63">2.2.3. Try-catch &#x2013; capturing messages</a></li>
<li><a href="#org6bc9a7d">2.2.4. Types of exceptions</a></li>
<li><a href="#org91c8033">2.2.5. Assertions</a></li>
</ul>
</li>
<li><a href="#org2819933">2.3. Working with data</a>
<ul>
<li><a href="#orgec7d9ce">2.3.1. More on lists</a></li>
<li><a href="#orgbe81e2f">2.3.2. More on sets &#x2013; union</a></li>
<li><a href="#org98c1793">2.3.3. More on sets &#x2013; intersection</a></li>
<li><a href="#org801682b">2.3.4. More on sets &#x2013; set difference</a></li>
<li><a href="#org3d83b38">2.3.5. More on set &#x2013; subsets</a></li>
<li><a href="#org745ca5f">2.3.6. Better indexing &#x2013; slices</a></li>
<li><a href="#org5dbc4b8">2.3.7. Better indexing &#x2013; range</a></li>
<li><a href="#org8224ef1">2.3.8. Better indexing &#x2013; reverse</a></li>
<li><a href="#org45a5916">2.3.9. Better indexing &#x2013; range</a></li>
<li><a href="#org894826a">2.3.10. Better indexing &#x2013; backwards</a></li>
<li><a href="#orga20d946">2.3.11. Better indexing &#x2013;backwards</a></li>
<li><a href="#org2b120b4">2.3.12. Quick Exercise &#x2013; Slicing</a></li>
</ul>
</li>
<li><a href="#org67fa3cb">2.4. Working with strings</a>
<ul>
<li><a href="#org162f390">2.4.1. Formatting strings</a></li>
<li><a href="#org6eb0030">2.4.2. Better ways of printing strings - %</a></li>
<li><a href="#org4cfd9bf">2.4.3. Better ways of printing strings &#x2013; data specifiers</a></li>
<li><a href="#org89692a3">2.4.4. Better ways of printing strings &#x2013; floating points</a></li>
<li><a href="#org18e1c4b">2.4.5. Better ways of printing strings &#x2013; floating points</a></li>
<li><a href="#org51494b6">2.4.6. Quick Exercise &#x2013; printing with <code>%</code></a></li>
<li><a href="#org0b09d26">2.4.7. Better ways of printing strings &#x2013; <code>.format()</code></a></li>
<li><a href="#org49d567a">2.4.8. Better ways of printing strings &#x2013; <code>.format()</code></a></li>
<li><a href="#org2ab8ff2">2.4.9. Better ways of printing strings &#x2013; alignment</a></li>
<li><a href="#org5d91607">2.4.10. Better ways of printing strings &#x2013; <code>f-strings</code></a></li>
<li><a href="#orgc650cd3">2.4.11. Better ways of printing strings &#x2013; <code>f-strings</code></a></li>
<li><a href="#org747785e">2.4.12. Better ways of printing strings &#x2013; <code>f-string</code></a></li>
<li><a href="#org938a44f">2.4.13. Quick Exercise &#x2013; printing with <code>f-string</code></a></li>
<li><a href="#org0eb33ad">2.4.14. Operations on strings &#x2013; splitting</a></li>
<li><a href="#orgc96f3cd">2.4.15. Operations on strings &#x2013; joining</a></li>
<li><a href="#org84e299e">2.4.16. Operations on strings &#x2013; changing case</a></li>
<li><a href="#orgf62a3e0">2.4.17. Operations on strings &#x2013; replacing strings</a></li>
<li><a href="#org9c702dc">2.4.18. Operations on strings &#x2013; does it contain a substring?</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8097a01">3. OOP</a>
<ul>
<li><a href="#orgebaf236">3.1. Classes</a>
<ul>
<li><a href="#orgee62e64">3.1.1. Introduction to classes</a></li>
<li><a href="#org3a071c8">3.1.2. Basic syntax</a></li>
<li><a href="#org4fb8c84">3.1.3. Init method</a></li>
<li><a href="#org20ede27">3.1.4. Instantiating</a></li>
<li><a href="#orgf43c925">3.1.5. Class variables</a></li>
<li><a href="#org86edd2f">3.1.6. Class Methods</a></li>
<li><a href="#orgca9a11b">3.1.7. dunder-methods</a></li>
<li><a href="#org887cee8">3.1.8. dunder-methods</a></li>
<li><a href="#org8c0fe87">3.1.9. dunder-methods</a></li>
<li><a href="#org42aca6c">3.1.10. <code>__len__</code></a></li>
<li><a href="#org9709ab1">3.1.11. <code>__getitem__</code></a></li>
<li><a href="#org05599ea">3.1.12. <code>__call__</code></a></li>
<li><a href="#orge199f00">3.1.13. <code>__iter__</code> and <code>__next__</code></a></li>
<li><a href="#org779ed4b">3.1.14. <code>__iter__</code> and <code>__next__</code></a></li>
<li><a href="#orgf3014e1">3.1.15. <code>__iter__</code> and <code>__next__</code></a></li>
<li><a href="#org9edc353">3.1.16. Inheritance</a></li>
<li><a href="#org5ce6493">3.1.17. Inheritance</a></li>
<li><a href="#org74cd5c2">3.1.18. Inheritance</a></li>
<li><a href="#org481af09">3.1.19. Inheritance</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3ccfd52">4. Exercise</a>
<ul>
<li><a href="#orgba2477f">4.1. Exercise</a>
<ul>
<li><a href="#org6641564">4.1.1. An object based library system</a></li>
<li><a href="#org62ac037">4.1.2. Adding data</a></li>
<li><a href="#org8feac0d">4.1.3. Locating a book</a></li>
<li><a href="#orge56c0a1">4.1.4. Updating our database</a></li>
<li><a href="#org217c927">4.1.5. Printed representation</a></li>
<li><a href="#org8e97217">4.1.6. Extending our OOP usage</a></li>
<li><a href="#org50cbda2">4.1.7. Printed representation &#x2013; challenge.</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org17868d1" class="outline-2">
<h2 id="org17868d1"><span class="section-number-2">1.</span> Proxy</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgcc36e7b" class="outline-3">
<h3 id="orgcc36e7b"><span class="section-number-3">1.1.</span> Univ-tln proxy</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org1736c34" class="outline-4">
<h4 id="org1736c34"><span class="section-number-4">1.1.1.</span> Setting up a proxy in Linux &#x2013; environment variables</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Environment variables are variables that are set in the Linux environment and are
used to configure some high-level details in Linux.
</p>

<p>
The command to create/set an environment is:
</p>

<pre class="example">
export VARIABLE_NAME=""
</pre>

<p>
Exporting a variable in this way will mean <code>VARIABLE_NAME</code> will be accessible while
you're logged in. Every time you log in you will have to set this variable again.
</p>
</div>
</div>

<div id="outline-container-orgfbc7212" class="outline-4">
<h4 id="orgfbc7212"><span class="section-number-4">1.1.2.</span> Setting up a proxy in Linux &#x2013; univ-tln specific</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
In the université de Toulon, you're required to use the university's proxy server to
access the internet. Therefore, in Linux at least, you will have to tell the system
where the proxy server is with an environment variable.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #483d8b;">export</span> <span style="color: #a0522d;">HTTP_PROXY</span>=<span style="color: #8b2252;">'&lt;username&gt;:&lt;password&gt;@proxy.univ-tln.fr:3128'</span>
<span style="color: #483d8b;">export</span> <span style="color: #a0522d;">HTTPS_PROXY</span>=<span style="color: #8b2252;">'&lt;username&gt;:&lt;password&gt;@proxy.univ-tln.fr:3128'</span>
<span style="color: #483d8b;">export</span> <span style="color: #a0522d;">FTP_PROXY</span>=<span style="color: #8b2252;">'&lt;username&gt;:&lt;password&gt;@proxy.univ-tln.fr:3128'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org24d1595" class="outline-4">
<h4 id="org24d1595"><span class="section-number-4">1.1.3.</span> Setting up a proxy in the .bashrc</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
If you don't wish to set the variable every time log in, you should enter the same
commands into a <code>.bashrc</code> in your home directory.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #483d8b;">export</span> <span style="color: #a0522d;">HTTP_PROXY</span>=<span style="color: #8b2252;">'...'</span>
<span style="color: #483d8b;">export</span> <span style="color: #a0522d;">HTTPS_PROXY</span>=<span style="color: #8b2252;">'...'</span>
<span style="color: #483d8b;">export</span> <span style="color: #a0522d;">FTP_PROXY</span>=<span style="color: #8b2252;">'...'</span>
</pre>
</div>

<p>
When you log in, the <code>.bashrc</code> file will be run and these variables will be set for you.
</p>
</div>
</div>
</div>
</div>
