2022-2023/Programming Level-up/week-2/lecture.tex
% Created 2021-11-16 mar. 12:03
% Intended LaTeX compiler: pdflatex
\documentclass[10pt]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\setlength{\parskip}{5pt}
\newcommand{\footnoteframe}[1]{\footnote[frame]{#1}}
\addtobeamertemplate{footnote}{}{\vspace{2ex}}
\usepackage{tabularx}
\usetheme{Berkeley}
\author{Jay Morgan}
\date{2021-10-01}
\title{Programming Level-up}
\subtitle{Lecture 2 - More advanced Python \& Classes}
\hypersetup{
 pdfauthor={Jay Morgan},
 pdftitle={Programming Level-up},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.4.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\begin{frame}{Outline}
\tableofcontents
\end{frame}


\section{Proxy}
\label{sec:orgd44dba2}

\subsection{Univ-tln proxy}
\label{sec:orgc6bb8ed}

\begin{frame}[label={sec:org9afa632},fragile]{Setting up a proxy in Linux -- environment variables}
 Environment variables are variables that are set in the Linux environment and are
used to configure some high-level details in Linux.

The command to create/set an environment is:

\begin{verbatim}
export VARIABLE_NAME=""
\end{verbatim}

Exporting a variable in this way will mean \texttt{VARIABLE\_NAME} will be accessible while
you're logged in. Every time you log in you will have to set this variable again.
\end{frame}

\begin{frame}[label={sec:org15ba41f},fragile]{Setting up a proxy in Linux -- univ-tln specific}
 In the université de Toulon, you're required to use the university's proxy server to
access the internet. Therefore, in Linux at least, you will have to tell the system
where the proxy server is with an environment variable.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{bash}
export HTTP_PROXY='<username>:<password>@proxy.univ-tln.fr:3128'
export HTTPS_PROXY='<username>:<password>@proxy.univ-tln.fr:3128'
export FTP_PROXY='<username>:<password>@proxy.univ-tln.fr:3128'
\end{minted}
\end{frame}

\begin{frame}[label={sec:org0e64f4a},fragile]{Setting up a proxy in the .bashrc}
 If you don't wish to set the variable every time log in, you should enter the same
commands into a \texttt{.bashrc} in your home directory.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{bash}
export HTTP_PROXY='...'
export HTTPS_PROXY='...'
export FTP_PROXY='...'
\end{minted}

When you log in, the \texttt{.bashrc} file will be run and these variables will be set for you.
\end{frame}
