2021-2022/Programming Level Up/week-2/lecture.org
* Advanced syntax

** List comprehensions

*** List comprehensions

We have seen previously how =for= loops work. Knowing the syntax of a =for= loop and
wanting to populate a list with some data, we might be tempted to write:

#+begin_src python
x = []
for i in range(3):
    x.append(i)

print(x)
#+end_src

#+RESULTS:
: Results: 
: # => [0, 1, 2]

While this is perfectly valid Python code, Python itself provides 'List
comprehensions' to make this process easier.

#+begin_src python
x = [i for i in range(3)]
#+end_src

*** List comprehensions -- syntax

The syntax of a list comprehensions is:

#+begin_src python
[ <variable> for <variable> in <iterable> ]
#+end_src

We can also perform similar actions with a dictionary

#+begin_src python
[ <key>, <value> for <key>, <value> in <dictionary.items()> ]
#+end_src

*** List comprehensions -- dictionary

Python doesn't restrict us to list comprehensions, but we can do a similar
operation to create a dictionary.

#+begin_src python
x = [2, 5, 6]
y = {idx: val for idx, val in enumerate(x)}
print(y)
#+end_src

#+RESULTS:
: Results: 
: # => {0: 2, 1: 5, 2: 6}

Here, every item in =x= has been associated with its numerical index as a key thanks to
the =enumerate= function that returns both the index and value at iteration in the for loop.

*** List comprehensions -- using =if='s

Perhaps we only want to optionally perform an action within the list comprehension?
Python allows us to do this with the inline =if= statement we've seen in the previous lecture.

#+begin_src python
x = [i if i < 5 else -1 for i in range(7)]
print(x)
#+end_src

#+RESULTS:
: Results: 
: # => [0, 1, 2, 3, 4, -1, -1]

We add the inline =<var> if <condition> else <other-var>= before the =for= loop part of
the comprehension.

*** List comprehension -- using =if='s

There is another type of =if= statement in a list comprehension, this occurs when we
don't have an =else=.

#+begin_src python
x = [i for i in range(7) if i < 3]
print(x)
#+end_src

#+RESULTS:
: Results: 
: # => [0, 1, 2]

In this example, we're only 'adding' to the list if the condition ($i < 3$) is true,
else the element is not included in the resulting list.

*** List comprehensions -- multiple =for='s

If we like, we can also use nested for loops by simply adding another for loop into
the comprehension.

#+begin_src python
x = [(i, j) for i in range(2) for j in range(2)]

print(x)
#+end_src

#+RESULTS:
: Results: 
: # => [(0, 0), (0, 1), (1, 0), (1, 1)]

In this example, we're creating a tuple for each element, effectively each
combination of 1 and 0.

*** Quick Exercise -- List comprehension

- Using list comprehension, create a list of even numbers from 6 to 20, and assign
  this list to the variable named =even_numbers=.
- Create a new variable called =even_numbers_dict=, create a dictionary using the
  comprehension syntax. The keys of the dictionary should be the index of each
  element in =even_numbers=, while the value should be the even number.
- What is the 5th even number?

** Exceptions

