2022-2023/Programming Level-up/week-2/lecture.html

<div id="outline-container-org94fde6f" class="outline-2">
<h2 id="org94fde6f"><span class="section-number-2">2.</span> Advanced syntax</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org4272fae" class="outline-3">
<h3 id="org4272fae"><span class="section-number-3">2.1.</span> List comprehensions</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgaed9718" class="outline-4">
<h4 id="orgaed9718"><span class="section-number-4">2.1.1.</span> List comprehensions</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
We have seen previously how <code>for</code> loops work. Knowing the syntax of a <code>for</code> loop and
wanting to populate a list with some data, we might be tempted to write:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">x</span> = []
<span style="color: #a020f0;">for</span> i <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">range</span>(3):
<span style="background-color: #f2f2f2;"> </span>   x.append(i)

<span style="color: #a020f0;">print</span>(x)
</pre>
</div>

<pre class="example">
Results: 
# =&gt; [0, 1, 2]
</pre>


<p>
While this is perfectly valid Python code, Python itself provides 'List
comprehensions' to make this process easier.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">x</span> = [i <span style="color: #a020f0;">for</span> i <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">range</span>(3)]
</pre>
</div>
</div>
</div>

<div id="outline-container-org80a3b51" class="outline-4">
<h4 id="org80a3b51"><span class="section-number-4">2.1.2.</span> List comprehensions &#x2013; syntax</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
The syntax of a list comprehensions is:
</p>

<div class="org-src-container">
<pre class="src src-python">[ &lt;variable&gt; <span style="color: #a020f0;">for</span> &lt;variable&gt; <span style="color: #a020f0;">in</span> &lt;iterable&gt; ]
</pre>
</div>

<p>
We can also perform similar actions with a dictionary
</p>

<div class="org-src-container">
<pre class="src src-python">[ &lt;key&gt;, &lt;value&gt; <span style="color: #a020f0;">for</span> &lt;key&gt;, &lt;value&gt; <span style="color: #a020f0;">in</span> &lt;dictionary.items()&gt; ]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd0e0af5" class="outline-4">
<h4 id="orgd0e0af5"><span class="section-number-4">2.1.3.</span> List comprehensions &#x2013; dictionary</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
Python doesn't restrict us to list comprehensions, but we can do a similar
operation to create a dictionary.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">x</span> = [2, 5, 6]
<span style="color: #a0522d;">y</span> = {idx: val <span style="color: #a020f0;">for</span> idx, val <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">enumerate</span>(x)}
<span style="color: #a020f0;">print</span>(y)
</pre>
</div>

<pre class="example">
Results: 
# =&gt; {0: 2, 1: 5, 2: 6}
</pre>


<p>
Here, every item in <code>x</code> has been associated with its numerical index as a key thanks to
the <code>enumerate</code> function that returns both the index and value at iteration in the for loop.
</p>
</div>
</div>

<div id="outline-container-org53c22a7" class="outline-4">
<h4 id="org53c22a7"><span class="section-number-4">2.1.4.</span> List comprehensions &#x2013; using <code>if</code>'s</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
Perhaps we only want to optionally perform an action within the list comprehension?
Python allows us to do this with the inline <code>if</code> statement we've seen in the previous lecture.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">x</span> = [i <span style="color: #a020f0;">if</span> i &lt; 5 <span style="color: #a020f0;">else</span> -1 <span style="color: #a020f0;">for</span> i <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">range</span>(7)]
<span style="color: #a020f0;">print</span>(x)
</pre>
</div>

<pre class="example">
Results: 
# =&gt; [0, 1, 2, 3, 4, -1, -1]
</pre>


<p>
We add the inline <code>&lt;var&gt; if &lt;condition&gt; else &lt;other-var&gt;</code> before the <code>for</code> loop part of
the comprehension.
</p>
</div>
</div>

<div id="outline-container-org0042848" class="outline-4">
<h4 id="org0042848"><span class="section-number-4">2.1.5.</span> List comprehension &#x2013; using <code>if</code>'s</h4>
<div class="outline-text-4" id="text-2-1-5">
<p>
There is another type of <code>if</code> statement in a list comprehension, this occurs when we
don't have an <code>else</code>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">x</span> = [i <span style="color: #a020f0;">for</span> i <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">range</span>(7) <span style="color: #a020f0;">if</span> i &lt; 3]
<span style="color: #a020f0;">print</span>(x)
</pre>
</div>

<pre class="example">
Results: 
# =&gt; [0, 1, 2]
</pre>


<p>
In this example, we're only 'adding' to the list if the condition (\(i < 3\)) is true,
else the element is not included in the resulting list.
</p>
</div>
</div>

<div id="outline-container-orgb932dbe" class="outline-4">
<h4 id="orgb932dbe"><span class="section-number-4">2.1.6.</span> List comprehensions &#x2013; multiple <code>for</code>'s</h4>
<div class="outline-text-4" id="text-2-1-6">
<p>
If we like, we can also use nested for loops by simply adding another for loop into
the comprehension.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">x</span> = [(i, j) <span style="color: #a020f0;">for</span> i <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">range</span>(2) <span style="color: #a020f0;">for</span> j <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">range</span>(2)]

<span style="color: #a020f0;">print</span>(x)
</pre>
</div>

<pre class="example">
Results: 
# =&gt; [(0, 0), (0, 1), (1, 0), (1, 1)]
</pre>


<p>
In this example, we're creating a tuple for each element, effectively each
combination of 1 and 0.
</p>
</div>
</div>

<div id="outline-container-orgde06d3c" class="outline-4">
<h4 id="orgde06d3c"><span class="section-number-4">2.1.7.</span> Quick Exercise &#x2013; List comprehension</h4>
<div class="outline-text-4" id="text-2-1-7">
<ul class="org-ul">
<li>Using list comprehension, create a list of even numbers from 6 to 20, and assign
this list to the variable named <code>even_numbers</code>.</li>
<li>Create a new variable called <code>even_numbers_dict</code>, create a dictionary using the
comprehension syntax. The keys of the dictionary should be the index of each
element in <code>even_numbers</code>, while the value should be the even number.</li>
<li>What is the 5th even number?</li>
</ul>
</div>
</div>
</div>
