2022-2023/Programming Level-up/week-2/lecture.tex

\section{Advanced syntax}
\label{sec:orgf05c9e6}

\subsection{List comprehensions}
\label{sec:orgd2415c1}

\begin{frame}[label={sec:org4056d08},fragile]{List comprehensions}
 We have seen previously how \texttt{for} loops work. Knowing the syntax of a \texttt{for} loop and
wanting to populate a list with some data, we might be tempted to write:

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
x = []
for i in range(3):
    x.append(i)

print(x)
\end{minted}

\begin{verbatim}
Results: 
# => [0, 1, 2]
\end{verbatim}


While this is perfectly valid Python code, Python itself provides 'List
comprehensions' to make this process easier.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
x = [i for i in range(3)]
\end{minted}
\end{frame}

\begin{frame}[label={sec:orge41f586},fragile]{List comprehensions -- syntax}
 The syntax of a list comprehensions is:

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
[ <variable> for <variable> in <iterable> ]
\end{minted}

We can also perform similar actions with a dictionary

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
[ <key>, <value> for <key>, <value> in <dictionary.items()> ]
\end{minted}
\end{frame}

\begin{frame}[label={sec:org55c49ac},fragile]{List comprehensions -- dictionary}
 Python doesn't restrict us to list comprehensions, but we can do a similar
operation to create a dictionary.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
x = [2, 5, 6]
y = {idx: val for idx, val in enumerate(x)}
print(y)
\end{minted}

\begin{verbatim}
Results: 
# => {0: 2, 1: 5, 2: 6}
\end{verbatim}


Here, every item in \texttt{x} has been associated with its numerical index as a key thanks to
the \texttt{enumerate} function that returns both the index and value at iteration in the for loop.
\end{frame}

\begin{frame}[label={sec:orgce4f0c5},fragile]{List comprehensions -- using \texttt{if}'s}
 Perhaps we only want to optionally perform an action within the list comprehension?
Python allows us to do this with the inline \texttt{if} statement we've seen in the previous lecture.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
x = [i if i < 5 else -1 for i in range(7)]
print(x)
\end{minted}

\begin{verbatim}
Results: 
# => [0, 1, 2, 3, 4, -1, -1]
\end{verbatim}


We add the inline \texttt{<var> if <condition> else <other-var>} before the \texttt{for} loop part of
the comprehension.
\end{frame}

\begin{frame}[label={sec:orgcf7fef6},fragile]{List comprehension -- using \texttt{if}'s}
 There is another type of \texttt{if} statement in a list comprehension, this occurs when we
don't have an \texttt{else}.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
x = [i for i in range(7) if i < 3]
print(x)
\end{minted}

\begin{verbatim}
Results: 
# => [0, 1, 2]
\end{verbatim}


In this example, we're only 'adding' to the list if the condition (\(i < 3\)) is true,
else the element is not included in the resulting list.
\end{frame}

\begin{frame}[label={sec:orga2ee4a3},fragile]{List comprehensions -- multiple \texttt{for}'s}
 If we like, we can also use nested for loops by simply adding another for loop into
the comprehension.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
x = [(i, j) for i in range(2) for j in range(2)]

print(x)
\end{minted}

\begin{verbatim}
Results: 
# => [(0, 0), (0, 1), (1, 0), (1, 1)]
\end{verbatim}


In this example, we're creating a tuple for each element, effectively each
combination of 1 and 0.
\end{frame}

\begin{frame}[label={sec:org5f9c2a0},fragile]{Quick Exercise -- List comprehension}
 \begin{itemize}
\item Using list comprehension, create a list of even numbers from 6 to 20, and assign
this list to the variable named \texttt{even\_numbers}.
\item Create a new variable called \texttt{even\_numbers\_dict}, create a dictionary using the
comprehension syntax. The keys of the dictionary should be the index of each
element in \texttt{even\_numbers}, while the value should be the even number.
\item What is the 5th even number?
\end{itemize}
\end{frame}
