2022-2023/Programming Level-up/week-2/lecture.html

<div id="outline-container-orgd0617c7" class="outline-3">
<h3 id="orgd0617c7"><span class="section-number-3">2.2.</span> Exceptions</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org21d6063" class="outline-4">
<h4 id="org21d6063"><span class="section-number-4">2.2.1.</span> Dealing with Errors</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
When programming, its good to be defensive and handle errors gracefully. For example,
if you're creating a program, that as part of its process, reads from a file, its
possible that this file may not exist at the point the program tries to read it. If
it doesn't exist, the program will crash giving an error such as: <code>FileNotfoundError</code>.
</p>

<p>
Perhaps this file is non-essential to the operation of the program, and we can
continue without the file. In these cases, we will want to appropriately catch the
error to prevent it from stopping Python.
</p>
</div>
</div>

<div id="outline-container-orgdb36bb4" class="outline-4">
<h4 id="orgdb36bb4"><span class="section-number-4">2.2.2.</span> Try-catch</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Try-catches are keywords that introduce a scope where the statements are executed,
and if an error (of a certain type IndexError in this example) occurs, different
statements could be executed.
</p>

<p>
In this example, we are trying to access an element in a list using an index larger
than the length of the list. This will produce an <code>IndexError</code>. Instead of exiting
Python with an error, however, we can catch the error, and print a string.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">x</span> = [1, 2, 3]

<span style="color: #a020f0;">try</span>:
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">print</span>(x[3])
<span style="color: #a020f0;">except</span> <span style="color: #228b22;">IndexError</span>:
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">print</span>(<span style="color: #8b2252;">"Couldn't access element"</span>)
</pre>
</div>

<pre class="example">
Results: 
# =&gt; Couldn't access element
</pre>
</div>
</div>

<div id="outline-container-orga072c63" class="outline-4">
<h4 id="orga072c63"><span class="section-number-4">2.2.3.</span> Try-catch &#x2013; capturing messages</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
If we wanted to include the original error message in the print statement, we can use
the form:
</p>

<pre class="example">
except &lt;error&gt; as &lt;variable&gt;
</pre>

<p>
This provides us with an variable containing the original error that we can use later
on in the try-catch form.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">x</span> = [1, 2, 3]

<span style="color: #a020f0;">try</span>:
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">print</span>(x[3])
<span style="color: #a020f0;">except</span> <span style="color: #228b22;">IndexError</span> <span style="color: #a020f0;">as</span> e:
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">print</span>(f<span style="color: #8b2252;">"Couldn't access elements at index beacuse: {e}"</span>)
</pre>
</div>

<pre class="example">
Results: 
# =&gt; Couldn't access elements at index beacuse: list index out of range
</pre>
</div>
</div>

<div id="outline-container-org6bc9a7d" class="outline-4">
<h4 id="org6bc9a7d"><span class="section-number-4">2.2.4.</span> Types of exceptions</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
There are numerous types of errors that could occur in a Python. Here are just some
of the most common.
</p>

<ul class="org-ul">
<li>IndexError &#x2013; Raised when a sequence subscript is out of range.</li>
<li>ValueError &#x2013; Raised when an operation or function receives an argument that has the right type but an inappropriate value</li>
<li>AssertionError &#x2013; Raised when an assert statement fails.</li>
<li>FileNotFoundError &#x2013; Raised when a file or directory is requested but doesn’t exist.</li>
</ul>

<p>
The full list of exceptions in Python 3 can be found at: <a href="https://docs.python.org/3/library/exceptions.html">https://docs.python.org/3/library/exceptions.html</a>
</p>
</div>
</div>

<div id="outline-container-org91c8033" class="outline-4">
<h4 id="org91c8033"><span class="section-number-4">2.2.5.</span> Assertions</h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
One of the previous errors (<code>AssertionError</code>) occurs when an assert statement
fails. Assert is a keyword provided to test some condition and raise an error if the
condition is false. It typically requires less code than an <code>if</code>-statement that raises
an error, so they might be useful for checking the inputs to functions, for example:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">my_divide</span>(a, b):
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">assert</span> b != 0
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">return</span> a / b

my_divide(1, 2)
my_divide(1, 0)
</pre>
</div>

<p>
Here we are checking that the divisor is not a 0, in which case division is not defined.
</p>
</div>
</div>
</div>

<div id="outline-container-org2819933" class="outline-3">
<h3 id="org2819933"><span class="section-number-3">2.3.</span> Working with data</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-orgec7d9ce" class="outline-4">
<h4 id="orgec7d9ce"><span class="section-number-4">2.3.1.</span> More on lists</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
In a previous lecture, we found that we can add <code>.append()</code> to the end of a variable of
a type list to add an element to the end of the list. Lists have many more methods
associated with them that will be useful when programming in Python.
</p>

<p>
Lists have a number of other convenient functions\footnoteframe{https://docs.python.org/3/tutorial/datastructures.html}.
</p>

<p>
Some of these include:
</p>

<div class="org-src-container">
<pre class="src src-python">my_list.insert(0, <span style="color: #8b2252;">"dog"</span>)  <span style="color: #b22222;"># </span><span style="color: #b22222;">insert "dog" at index 0</span>
my_list.count(2)          <span style="color: #b22222;"># </span><span style="color: #b22222;">count the number of times 2 appears</span>
my_list.reverse()         <span style="color: #b22222;"># </span><span style="color: #b22222;">reverse the list</span>
</pre>
</div>
</div>
</div>
