2022-2023/Programming Level-up/week-2/lecture.tex

\subsection{Exceptions}
\label{sec:org1ebb98f}

\begin{frame}[label={sec:org4302f1e},fragile]{Dealing with Errors}
 When programming, its good to be defensive and handle errors gracefully. For example,
if you're creating a program, that as part of its process, reads from a file, its
possible that this file may not exist at the point the program tries to read it. If
it doesn't exist, the program will crash giving an error such as: \texttt{FileNotfoundError}.

Perhaps this file is non-essential to the operation of the program, and we can
continue without the file. In these cases, we will want to appropriately catch the
error to prevent it from stopping Python.
\end{frame}

\begin{frame}[label={sec:org99543ba},fragile]{Try-catch}
 Try-catches are keywords that introduce a scope where the statements are executed,
and if an error (of a certain type IndexError in this example) occurs, different
statements could be executed.

In this example, we are trying to access an element in a list using an index larger
than the length of the list. This will produce an \texttt{IndexError}. Instead of exiting
Python with an error, however, we can catch the error, and print a string.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
x = [1, 2, 3]

try:
    print(x[3])
except IndexError:
    print("Couldn't access element")
\end{minted}

\begin{verbatim}
Results: 
# => Couldn't access element
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:orgb541120},fragile]{Try-catch -- capturing messages}
 If we wanted to include the original error message in the print statement, we can use
the form:

\begin{verbatim}
except <error> as <variable>
\end{verbatim}

This provides us with an variable containing the original error that we can use later
on in the try-catch form.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
x = [1, 2, 3]

try:
    print(x[3])
except IndexError as e:
    print(f"Couldn't access elements at index beacuse: {e}")
\end{minted}

\begin{verbatim}
Results: 
# => Couldn't access elements at index beacuse: list index out of range
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org9bec6a4}]{Types of exceptions}
There are numerous types of errors that could occur in a Python. Here are just some
of the most common.

\begin{itemize}
\item IndexError -- Raised when a sequence subscript is out of range.
\item ValueError -- Raised when an operation or function receives an argument that has the right type but an inappropriate value
\item AssertionError -- Raised when an assert statement fails.
\item FileNotFoundError -- Raised when a file or directory is requested but doesn’t exist.
\end{itemize}

The full list of exceptions in Python 3 can be found at: \url{https://docs.python.org/3/library/exceptions.html}
\end{frame}

\begin{frame}[label={sec:orgef905ea},fragile]{Assertions}
 One of the previous errors (\texttt{AssertionError}) occurs when an assert statement
fails. Assert is a keyword provided to test some condition and raise an error if the
condition is false. It typically requires less code than an \texttt{if}-statement that raises
an error, so they might be useful for checking the inputs to functions, for example:

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
def my_divide(a, b):
    assert b != 0
    return a / b

my_divide(1, 2)
my_divide(1, 0)
\end{minted}

Here we are checking that the divisor is not a 0, in which case division is not defined.
\end{frame}

\subsection{Working with data}
\label{sec:org9ce25e0}

\begin{frame}[label={sec:orgd44e72a},fragile]{More on lists}
 In a previous lecture, we found that we can add \texttt{.append()} to the end of a variable of
a type list to add an element to the end of the list. Lists have many more methods
associated with them that will be useful when programming in Python.

Lists have a number of other convenient functions\footnoteframe{https://docs.python.org/3/tutorial/datastructures.html}.

Some of these include:

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
my_list.insert(0, "dog")  # insert "dog" at index 0
my_list.count(2)          # count the number of times 2 appears
my_list.reverse()         # reverse the list
\end{minted}
\end{frame}
