2021-2022/Programming Level Up/week-2/lecture.org
*** More on sets -- union

Sets, while containing only unique elements, have a number of useful functions to
perform certain set operations. Take for example the union (elements that are in
either sets) of two sets:

#+begin_src python
x = set([1, 2, 3, 4, 5])
y = set([5, 2, 6, -1, 10])

print(x.union(y))
#+end_src

#+RESULTS:
: Results: 
: # => {1, 2, 3, 4, 5, 6, 10, -1}

The syntax of using these methods follows:

#+begin_src
<set_1>.function(<set_2>)
#+end_src

*** More on sets -- intersection

Or the intersection (the elements that are in both) of two sets:

#+begin_src python
x = set([1, 2, 3, 4, 5])
y = set([5, 2, 6, -1, 10])

print(x.intersection(y))
#+end_src

#+RESULTS:
: Results: 
: # => {2, 5}

*** More on sets -- set difference

And the set difference (the elements that in set 1, but not in set 2):

#+begin_src python
x = set([1, 2, 3, 4, 5])
y = set([5, 2, 6, -1, 10])

print(x.difference(y))
#+end_src

#+RESULTS:
: Results: 
: # => {1, 3, 4}

*** More on set -- subsets

We can even return a boolean value if set 1 is a subset of set 2:

#+begin_src python
x = set([1, 2, 3, 4, 5])
y = set([5, 2, 6, -1, 10])
z = set([1, 2, 3, 4, 5, 6, 7])

print(x.issubset(y))
print(x.issubset(z))
#+end_src

#+RESULTS:
: Results: 
: # => False
: # => True

For a full list of what methods are available with sets, please refer to: https://realpython.com/python-sets/#operating-on-a-set

*** Better indexing -- slices

If we wanted to access an element from a data structure, such as a list, we would use
the =[ ]= accessor, specifying the index of the element we wish to retrieve (remember
that indexes start at zero!). But what if we ranted to access many elements at once?
Well to accomplish that, we have a slice or a range of indexes (not to be confused
with the =range= function). A slice is defined as:

#+begin_src
start_index:end_index
#+end_src

where the =end_index= is non inclusive -- it doesn't get included in the result. Here
is an example where we have a list of 6 numbers from 0 to 5, and we slice the list from index
0 to 3. Notice how the 3rd index is not included.

#+begin_src python
x = [0, 1, 2, 3, 4, 5]
print(x[0:3])
#+end_src

#+RESULTS:
: Results: 
: # => [0, 1, 2]

*** Better indexing -- range

When we use =start_index:end_index=, the slice increments by 1 from =start_index= to
=end_index=. If we wanted to increment by a different amount we can use the slicing
form:

#+begin_src
start_index:end_index:step
#+end_src

Here is an example where we step the indexes by 2:

#+begin_src python :results output pp
x = list(range(100))
print(x[10:15:2])
#+end_src

#+RESULTS:
: Results: 
: # => [10, 12, 14]

*** Better indexing -- reverse

One strange fact about the step is that if we specify a negative number for the step,
Python will work backwards, and effectively reverse the list.

#+begin_src python
x = list(range(5))

print(x[::-1])
#+end_src

#+RESULTS:
: Results: 
: # => [4, 3, 2, 1, 0]

*** Better indexing -- range

In a previous example, I created a slice like =0:3=. This was a little wasteful as we
can write slightly less code. If we write =:end_index=, Python assumes and creates a
slice from the first index (0) to the =end_index=. If we write =start_index:=, Python
assumes and creates a slice from =start_index= to the end of the list.

#+begin_src python
x = list(range(100))

print(x[:10])
print(x[90:])
#+end_src

#+RESULTS:
: Results: 
: # => [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
: # => [90, 91, 92, 93, 94, 95, 96, 97, 98, 99]

