2022-2023/Programming Level-up/week-2/lecture.html

<div id="outline-container-orgbe81e2f" class="outline-4">
<h4 id="orgbe81e2f"><span class="section-number-4">2.3.2.</span> More on sets &#x2013; union</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
Sets, while containing only unique elements, have a number of useful functions to
perform certain set operations. Take for example the union (elements that are in
either sets) of two sets:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">x</span> = <span style="color: #483d8b;">set</span>([1, 2, 3, 4, 5])
<span style="color: #a0522d;">y</span> = <span style="color: #483d8b;">set</span>([5, 2, 6, -1, 10])

<span style="color: #a020f0;">print</span>(x.union(y))
</pre>
</div>

<pre class="example">
Results: 
# =&gt; {1, 2, 3, 4, 5, 6, 10, -1}
</pre>


<p>
The syntax of using these methods follows:
</p>

<pre class="example">
&lt;set_1&gt;.function(&lt;set_2&gt;)
</pre>
</div>
</div>

<div id="outline-container-org98c1793" class="outline-4">
<h4 id="org98c1793"><span class="section-number-4">2.3.3.</span> More on sets &#x2013; intersection</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
Or the intersection (the elements that are in both) of two sets:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">x</span> = <span style="color: #483d8b;">set</span>([1, 2, 3, 4, 5])
<span style="color: #a0522d;">y</span> = <span style="color: #483d8b;">set</span>([5, 2, 6, -1, 10])

<span style="color: #a020f0;">print</span>(x.intersection(y))
</pre>
</div>

<pre class="example">
Results: 
# =&gt; {2, 5}
</pre>
</div>
</div>

<div id="outline-container-org801682b" class="outline-4">
<h4 id="org801682b"><span class="section-number-4">2.3.4.</span> More on sets &#x2013; set difference</h4>
<div class="outline-text-4" id="text-2-3-4">
<p>
And the set difference (the elements that in set 1, but not in set 2):
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">x</span> = <span style="color: #483d8b;">set</span>([1, 2, 3, 4, 5])
<span style="color: #a0522d;">y</span> = <span style="color: #483d8b;">set</span>([5, 2, 6, -1, 10])

<span style="color: #a020f0;">print</span>(x.difference(y))
</pre>
</div>

<pre class="example">
Results: 
# =&gt; {1, 3, 4}
</pre>
</div>
</div>

<div id="outline-container-org3d83b38" class="outline-4">
<h4 id="org3d83b38"><span class="section-number-4">2.3.5.</span> More on set &#x2013; subsets</h4>
<div class="outline-text-4" id="text-2-3-5">
<p>
We can even return a boolean value if set 1 is a subset of set 2:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">x</span> = <span style="color: #483d8b;">set</span>([1, 2, 3, 4, 5])
<span style="color: #a0522d;">y</span> = <span style="color: #483d8b;">set</span>([5, 2, 6, -1, 10])
<span style="color: #a0522d;">z</span> = <span style="color: #483d8b;">set</span>([1, 2, 3, 4, 5, 6, 7])

<span style="color: #a020f0;">print</span>(x.issubset(y))
<span style="color: #a020f0;">print</span>(x.issubset(z))
</pre>
</div>

<pre class="example">
Results: 
# =&gt; False
# =&gt; True
</pre>


<p>
For a full list of what methods are available with sets, please refer to: <a href="https://realpython.com/python-sets/#operating-on-a-set">https://realpython.com/python-sets/#operating-on-a-set</a>
</p>
</div>
</div>

<div id="outline-container-org745ca5f" class="outline-4">
<h4 id="org745ca5f"><span class="section-number-4">2.3.6.</span> Better indexing &#x2013; slices</h4>
<div class="outline-text-4" id="text-2-3-6">
<p>
If we wanted to access an element from a data structure, such as a list, we would use
the <code>[ ]</code> accessor, specifying the index of the element we wish to retrieve (remember
that indexes start at zero!). But what if we ranted to access many elements at once?
Well to accomplish that, we have a slice or a range of indexes (not to be confused
with the <code>range</code> function). A slice is defined as:
</p>

<pre class="example">
start_index:end_index
</pre>

<p>
where the <code>end_index</code> is non inclusive &#x2013; it doesn't get included in the result. Here
is an example where we have a list of 6 numbers from 0 to 5, and we slice the list from index
0 to 3. Notice how the 3rd index is not included.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">x</span> = [0, 1, 2, 3, 4, 5]
<span style="color: #a020f0;">print</span>(x[0:3])
</pre>
</div>

<pre class="example">
Results: 
# =&gt; [0, 1, 2]
</pre>
</div>
</div>

<div id="outline-container-org5dbc4b8" class="outline-4">
<h4 id="org5dbc4b8"><span class="section-number-4">2.3.7.</span> Better indexing &#x2013; range</h4>
<div class="outline-text-4" id="text-2-3-7">
<p>
When we use <code>start_index:end_index</code>, the slice increments by 1 from <code>start_index</code> to
<code>end_index</code>. If we wanted to increment by a different amount we can use the slicing
form:
</p>

<pre class="example">
start_index:end_index:step
</pre>

<p>
Here is an example where we step the indexes by 2:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">x</span> = <span style="color: #483d8b;">list</span>(<span style="color: #483d8b;">range</span>(100))
<span style="color: #a020f0;">print</span>(x[10:15:2])
</pre>
</div>

<pre class="example">
Results: 
# =&gt; [10, 12, 14]
</pre>
</div>
</div>

<div id="outline-container-org8224ef1" class="outline-4">
<h4 id="org8224ef1"><span class="section-number-4">2.3.8.</span> Better indexing &#x2013; reverse</h4>
<div class="outline-text-4" id="text-2-3-8">
<p>
One strange fact about the step is that if we specify a negative number for the step,
Python will work backwards, and effectively reverse the list.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">x</span> = <span style="color: #483d8b;">list</span>(<span style="color: #483d8b;">range</span>(5))

<span style="color: #a020f0;">print</span>(x[::-1])
</pre>
</div>

<pre class="example">
Results: 
# =&gt; [4, 3, 2, 1, 0]
</pre>
</div>
</div>

<div id="outline-container-org45a5916" class="outline-4">
<h4 id="org45a5916"><span class="section-number-4">2.3.9.</span> Better indexing &#x2013; range</h4>
<div class="outline-text-4" id="text-2-3-9">
<p>
In a previous example, I created a slice like <code>0:3</code>. This was a little wasteful as we
can write slightly less code. If we write <code>:end_index</code>, Python assumes and creates a
slice from the first index (0) to the <code>end_index</code>. If we write <code>start_index:</code>, Python
assumes and creates a slice from <code>start_index</code> to the end of the list.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">x</span> = <span style="color: #483d8b;">list</span>(<span style="color: #483d8b;">range</span>(100))

<span style="color: #a020f0;">print</span>(x[:10])
<span style="color: #a020f0;">print</span>(x[90:])
</pre>
</div>

<pre class="example">
Results: 
# =&gt; [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
# =&gt; [90, 91, 92, 93, 94, 95, 96, 97, 98, 99]
</pre>
</div>
</div>
