2022-2023/Programming Level-up/week-2/lecture.tex

\begin{frame}[label={sec:orgadc7474},fragile]{More on sets -- union}
 Sets, while containing only unique elements, have a number of useful functions to
perform certain set operations. Take for example the union (elements that are in
either sets) of two sets:

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
x = set([1, 2, 3, 4, 5])
y = set([5, 2, 6, -1, 10])

print(x.union(y))
\end{minted}

\begin{verbatim}
Results: 
# => {1, 2, 3, 4, 5, 6, 10, -1}
\end{verbatim}


The syntax of using these methods follows:

\begin{verbatim}
<set_1>.function(<set_2>)
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org52d7459},fragile]{More on sets -- intersection}
 Or the intersection (the elements that are in both) of two sets:

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
x = set([1, 2, 3, 4, 5])
y = set([5, 2, 6, -1, 10])

print(x.intersection(y))
\end{minted}

\begin{verbatim}
Results: 
# => {2, 5}
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org8d122ca},fragile]{More on sets -- set difference}
 And the set difference (the elements that in set 1, but not in set 2):

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
x = set([1, 2, 3, 4, 5])
y = set([5, 2, 6, -1, 10])

print(x.difference(y))
\end{minted}

\begin{verbatim}
Results: 
# => {1, 3, 4}
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org35d5d4d},fragile]{More on set -- subsets}
 We can even return a boolean value if set 1 is a subset of set 2:

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
x = set([1, 2, 3, 4, 5])
y = set([5, 2, 6, -1, 10])
z = set([1, 2, 3, 4, 5, 6, 7])

print(x.issubset(y))
print(x.issubset(z))
\end{minted}

\begin{verbatim}
Results: 
# => False
# => True
\end{verbatim}


For a full list of what methods are available with sets, please refer to: \url{https://realpython.com/python-sets/\#operating-on-a-set}
\end{frame}

\begin{frame}[label={sec:org2de9855},fragile]{Better indexing -- slices}
 If we wanted to access an element from a data structure, such as a list, we would use
the \texttt{[ ]} accessor, specifying the index of the element we wish to retrieve (remember
that indexes start at zero!). But what if we ranted to access many elements at once?
Well to accomplish that, we have a slice or a range of indexes (not to be confused
with the \texttt{range} function). A slice is defined as:

\begin{verbatim}
start_index:end_index
\end{verbatim}

where the \texttt{end\_index} is non inclusive -- it doesn't get included in the result. Here
is an example where we have a list of 6 numbers from 0 to 5, and we slice the list from index
0 to 3. Notice how the 3rd index is not included.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
x = [0, 1, 2, 3, 4, 5]
print(x[0:3])
\end{minted}

\begin{verbatim}
Results: 
# => [0, 1, 2]
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:orge06b828},fragile]{Better indexing -- range}
 When we use \texttt{start\_index:end\_index}, the slice increments by 1 from \texttt{start\_index} to
\texttt{end\_index}. If we wanted to increment by a different amount we can use the slicing
form:

\begin{verbatim}
start_index:end_index:step
\end{verbatim}

Here is an example where we step the indexes by 2:

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
x = list(range(100))
print(x[10:15:2])
\end{minted}

\begin{verbatim}
Results: 
# => [10, 12, 14]
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org7a61cc0},fragile]{Better indexing -- reverse}
 One strange fact about the step is that if we specify a negative number for the step,
Python will work backwards, and effectively reverse the list.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
x = list(range(5))

print(x[::-1])
\end{minted}

\begin{verbatim}
Results: 
# => [4, 3, 2, 1, 0]
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org50df1bd},fragile]{Better indexing -- range}
 In a previous example, I created a slice like \texttt{0:3}. This was a little wasteful as we
can write slightly less code. If we write \texttt{:end\_index}, Python assumes and creates a
slice from the first index (0) to the \texttt{end\_index}. If we write \texttt{start\_index:}, Python
assumes and creates a slice from \texttt{start\_index} to the end of the list.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
x = list(range(100))

print(x[:10])
print(x[90:])
\end{minted}

\begin{verbatim}
Results: 
# => [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
# => [90, 91, 92, 93, 94, 95, 96, 97, 98, 99]
\end{verbatim}
\end{frame}
