2021-2022/Programming Level Up/week-2/lecture.org
*** Better indexing -- backwards

Finally, we also work backwards from the end of list. If we use a negative number,
such as -1, we are telling Python, take the elements from the end of the list. -1 is
the final index, and numbers lower than -1 work further backwards through the list.

#+begin_src python :results output pp
x = list(range(100))

print(x[-1])
print(x[-2])
#+end_src

#+RESULTS:
: Results: 
: # => 99
: # => 98

*** Better indexing --backwards

Slicing with negative indexes, also works. Here we are creating a slice from the end
of the list - 10, to the last (but not including) index.

#+begin_src python
x = list(range(100))

print(x[-10:-1])
#+end_src

#+RESULTS:
: Results: 
: # => [90, 91, 92, 93, 94, 95, 96, 97, 98]

*** Quick Exercise -- Slicing

- Create a list of elements from 0 to 100, of every 3rd number (e.g. use a range
  with a step).
- First, slice the first 5 indexes.
- Second, get the last 10 indexes.
- Third, get the 50th to 55th (inclusive) indexes.
- *Challenge* get the last 10 indexes, but only using positive indexes up to 10.

** Working with strings

*** Formatting strings

In many previous examples when we've printed strings, we've done something like:

#+begin_src python
age = 35

print("The value of age is", age)
#+end_src

#+RESULTS:
: Results: 
: # => The value of age is 35

While this works in this small context, it can get pretty cumbersome if we have many
variables we want to print, and we also want to change how they are displayed when
they are printed.

We're going to take a look now at much better ways of printing.

*** Better ways of printing strings - %

The first method is using =%=. When we print, we first construct a string with special
delimiters, such as =%s= that denotes a string, and =%d= that denotes a number. This is
telling Python where we want the values to be placed in the string.

Once we've created the string, we need to specify the data, which we do with =%
(...)=. Like, for example:

#+begin_src python
age = 35
name = "John"

print("%d years old" % age)  # no tuple for one variable
print("%s is %d years old" % (name, age)) 
#+end_src

#+RESULTS:
: Results: 
: # => 35 years old
: # => John is 35 years old

Here we are specifying the a string =%s= and number =%d=, and then giving the variables
that correspond with that data type.

*** Better ways of printing strings -- data specifiers

The special delimiters correspond with a data type. Here are some of the most common:

- =%s= -- For strings
- =%d= -- For numbers
- =%f= -- For floating point numbers.

There are others such as =%x= that prints the hexadecimal representation, but these are
less common. You can find the full list at: https://docs.python.org/3/library/stdtypes.html#old-string-formatting

*** Better ways of printing strings -- floating points

When using these delimiters, we can add modifiers to how they format and display the
value. Take a very common example, where we have a floating point value, and, when
printing it, we only want to print to 3 decimal places. To accomplish this, we again
use =%f= but add a =.3= to between the =%= and =f=. In this example, we are printing \pi to 3
decimal places.

#+begin_src python
print("Pi to 3 digits is: %.3f" % 3.1415926535)
#+end_src

#+RESULTS:
: Results: 
: # => Pi to 3 digits is: 3.142

