2022-2023/Programming Level-up/week-2/lecture.html

<div id="outline-container-org894826a" class="outline-4">
<h4 id="org894826a"><span class="section-number-4">2.3.10.</span> Better indexing &#x2013; backwards</h4>
<div class="outline-text-4" id="text-2-3-10">
<p>
Finally, we also work backwards from the end of list. If we use a negative number,
such as -1, we are telling Python, take the elements from the end of the list. -1 is
the final index, and numbers lower than -1 work further backwards through the list.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">x</span> = <span style="color: #483d8b;">list</span>(<span style="color: #483d8b;">range</span>(100))

<span style="color: #a020f0;">print</span>(x[-1])
<span style="color: #a020f0;">print</span>(x[-2])
</pre>
</div>

<pre class="example">
Results: 
# =&gt; 99
# =&gt; 98
</pre>
</div>
</div>

<div id="outline-container-orga20d946" class="outline-4">
<h4 id="orga20d946"><span class="section-number-4">2.3.11.</span> Better indexing &#x2013;backwards</h4>
<div class="outline-text-4" id="text-2-3-11">
<p>
Slicing with negative indexes, also works. Here we are creating a slice from the end
of the list - 10, to the last (but not including) index.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">x</span> = <span style="color: #483d8b;">list</span>(<span style="color: #483d8b;">range</span>(100))

<span style="color: #a020f0;">print</span>(x[-10:-1])
</pre>
</div>

<pre class="example">
Results: 
# =&gt; [90, 91, 92, 93, 94, 95, 96, 97, 98]
</pre>
</div>
</div>

<div id="outline-container-org2b120b4" class="outline-4">
<h4 id="org2b120b4"><span class="section-number-4">2.3.12.</span> Quick Exercise &#x2013; Slicing</h4>
<div class="outline-text-4" id="text-2-3-12">
<ul class="org-ul">
<li>Create a list of elements from 0 to 100, of every 3rd number (e.g. use a range
with a step).</li>
<li>First, slice the first 5 indexes.</li>
<li>Second, get the last 10 indexes.</li>
<li>Third, get the 50th to 55th (inclusive) indexes.</li>
<li><b>Challenge</b> get the last 10 indexes, but only using positive indexes up to 10.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org67fa3cb" class="outline-3">
<h3 id="org67fa3cb"><span class="section-number-3">2.4.</span> Working with strings</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-org162f390" class="outline-4">
<h4 id="org162f390"><span class="section-number-4">2.4.1.</span> Formatting strings</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
In many previous examples when we've printed strings, we've done something like:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">age</span> = 35

<span style="color: #a020f0;">print</span>(<span style="color: #8b2252;">"The value of age is"</span>, age)
</pre>
</div>

<pre class="example">
Results: 
# =&gt; The value of age is 35
</pre>


<p>
While this works in this small context, it can get pretty cumbersome if we have many
variables we want to print, and we also want to change how they are displayed when
they are printed.
</p>

<p>
We're going to take a look now at much better ways of printing.
</p>
</div>
</div>

<div id="outline-container-org6eb0030" class="outline-4">
<h4 id="org6eb0030"><span class="section-number-4">2.4.2.</span> Better ways of printing strings - %</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
The first method is using <code>%</code>. When we print, we first construct a string with special
delimiters, such as <code>%s</code> that denotes a string, and <code>%d</code> that denotes a number. This is
telling Python where we want the values to be placed in the string.
</p>

<p>
Once we've created the string, we need to specify the data, which we do with <code>%
(...)</code>. Like, for example:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">age</span> = 35
<span style="color: #a0522d;">name</span> = <span style="color: #8b2252;">"John"</span>

<span style="color: #a020f0;">print</span>(<span style="color: #8b2252;">"%d years old"</span> % age)  <span style="color: #b22222;"># </span><span style="color: #b22222;">no tuple for one variable</span>
<span style="color: #a020f0;">print</span>(<span style="color: #8b2252;">"%s is %d years old"</span> % (name, age)) 
</pre>
</div>

<pre class="example">
Results: 
# =&gt; 35 years old
# =&gt; John is 35 years old
</pre>


<p>
Here we are specifying the a string <code>%s</code> and number <code>%d</code>, and then giving the variables
that correspond with that data type.
</p>
</div>
</div>

<div id="outline-container-org4cfd9bf" class="outline-4">
<h4 id="org4cfd9bf"><span class="section-number-4">2.4.3.</span> Better ways of printing strings &#x2013; data specifiers</h4>
<div class="outline-text-4" id="text-2-4-3">
<p>
The special delimiters correspond with a data type. Here are some of the most common:
</p>

<ul class="org-ul">
<li><code>%s</code> &#x2013; For strings</li>
<li><code>%d</code> &#x2013; For numbers</li>
<li><code>%f</code> &#x2013; For floating point numbers.</li>
</ul>

<p>
There are others such as <code>%x</code> that prints the hexadecimal representation, but these are
less common. You can find the full list at: <a href="https://docs.python.org/3/library/stdtypes.html#old-string-formatting">https://docs.python.org/3/library/stdtypes.html#old-string-formatting</a>
</p>
</div>
</div>

<div id="outline-container-org89692a3" class="outline-4">
<h4 id="org89692a3"><span class="section-number-4">2.4.4.</span> Better ways of printing strings &#x2013; floating points</h4>
<div class="outline-text-4" id="text-2-4-4">
<p>
When using these delimiters, we can add modifiers to how they format and display the
value. Take a very common example, where we have a floating point value, and, when
printing it, we only want to print to 3 decimal places. To accomplish this, we again
use <code>%f</code> but add a <code>.3</code> to between the <code>%</code> and <code>f</code>. In this example, we are printing &pi; to 3
decimal places.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">print</span>(<span style="color: #8b2252;">"Pi to 3 digits is: %.3f"</span> % 3.1415926535)
</pre>
</div>

<pre class="example">
Results: 
