2022-2023/Programming Level-up/week-2/lecture.tex

\begin{frame}[label={sec:orgcf41742},fragile]{Better indexing -- backwards}
 Finally, we also work backwards from the end of list. If we use a negative number,
such as -1, we are telling Python, take the elements from the end of the list. -1 is
the final index, and numbers lower than -1 work further backwards through the list.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
x = list(range(100))

print(x[-1])
print(x[-2])
\end{minted}

\begin{verbatim}
Results: 
# => 99
# => 98
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:orgc57fd66},fragile]{Better indexing --backwards}
 Slicing with negative indexes, also works. Here we are creating a slice from the end
of the list - 10, to the last (but not including) index.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
x = list(range(100))

print(x[-10:-1])
\end{minted}

\begin{verbatim}
Results: 
# => [90, 91, 92, 93, 94, 95, 96, 97, 98]
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org8aaae30}]{Quick Exercise -- Slicing}
\begin{itemize}
\item Create a list of elements from 0 to 100, of every 3rd number (e.g. use a range
with a step).
\item First, slice the first 5 indexes.
\item Second, get the last 10 indexes.
\item Third, get the 50th to 55th (inclusive) indexes.
\item \alert{Challenge} get the last 10 indexes, but only using positive indexes up to 10.
\end{itemize}
\end{frame}

\subsection{Working with strings}
\label{sec:org8e6ac0a}

\begin{frame}[label={sec:org6ee7f76},fragile]{Formatting strings}
 In many previous examples when we've printed strings, we've done something like:

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
age = 35

print("The value of age is", age)
\end{minted}

\begin{verbatim}
Results: 
# => The value of age is 35
\end{verbatim}


While this works in this small context, it can get pretty cumbersome if we have many
variables we want to print, and we also want to change how they are displayed when
they are printed.

We're going to take a look now at much better ways of printing.
\end{frame}

\begin{frame}[label={sec:orgdcb6b85},fragile]{Better ways of printing strings - \%}
 The first method is using \texttt{\%}. When we print, we first construct a string with special
delimiters, such as \texttt{\%s} that denotes a string, and \texttt{\%d} that denotes a number. This is
telling Python where we want the values to be placed in the string.

Once we've created the string, we need to specify the data, which we do with \texttt{\%
(...)}. Like, for example:

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
age = 35
name = "John"

print("%d years old" % age)  # no tuple for one variable
print("%s is %d years old" % (name, age)) 
\end{minted}

\begin{verbatim}
Results: 
# => 35 years old
# => John is 35 years old
\end{verbatim}


Here we are specifying the a string \texttt{\%s} and number \texttt{\%d}, and then giving the variables
that correspond with that data type.
\end{frame}

\begin{frame}[label={sec:org946ad0a},fragile]{Better ways of printing strings -- data specifiers}
 The special delimiters correspond with a data type. Here are some of the most common:

\begin{itemize}
\item \texttt{\%s} -- For strings
\item \texttt{\%d} -- For numbers
\item \texttt{\%f} -- For floating point numbers.
\end{itemize}

There are others such as \texttt{\%x} that prints the hexadecimal representation, but these are
less common. You can find the full list at: \url{https://docs.python.org/3/library/stdtypes.html\#old-string-formatting}
\end{frame}

\begin{frame}[label={sec:org99f29a4},fragile]{Better ways of printing strings -- floating points}
 When using these delimiters, we can add modifiers to how they format and display the
value. Take a very common example, where we have a floating point value, and, when
printing it, we only want to print to 3 decimal places. To accomplish this, we again
use \texttt{\%f} but add a \texttt{.3} to between the \texttt{\%} and \texttt{f}. In this example, we are printing \(\pi\) to 3
decimal places.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
print("Pi to 3 digits is: %.3f" % 3.1415926535)
\end{minted}

\begin{verbatim}
Results: 
