2021-2022/Programming Level Up/week-2/lecture.org
*** Better ways of printing strings -- floating points

In the previous example, we used =.3= to specify 3 decimal places. If we put a number
before the decimal, like =10.3= we are telling Python /make this float occupy 10 spaces
and this float should have 3 decimal places printed/.  When it gets printed, you will
notice that it shifts to the right, it gets padded by space. If we use a negative
number in front of the decimal place, we are telling python to shift it to the left.

#+begin_src python
print("Pi to 3 digits is: %10.3f" % 3.1415926535)
print("Pi to 3 digits is: %-10.3f" % 3.1415926535)
#+end_src

#+RESULTS:
: Results: 
: # => Pi to 3 digits is:      3.142
: # => Pi to 3 digits is: 3.142

*** Quick Exercise -- printing with =%=

- Creating a dictionary containing the following information:

| Key  |    Value |
|------+----------|
| name |     Jane |
| age  |       35 |
| lon  | -3.52352 |
| lat  |  2.25222 |

- Print (using the =%= operator) the values of this dictionary so that the result looks
  like: "Jane (located at -3.5, 2.2) is 35 years old"

*** Better ways of printing strings -- =.format()=

Another way of performing 'string interpolation' where the values associated with
variables are printed with strings is accomplished using the =.format()= method.

To use this method, create a string with ={}= delimiters, and after the string, call
the =.format()= method, where the arguments to this method are the values you want to
include in the string. The number of values passed to =.format()= should be the same as
the number of ={}= in the string.

#+begin_src python
name = "Jane"
age = 35

print("{} is {} years old".format(name, age))
#+end_src

#+RESULTS:
: Results: 
: # => Jane is 35 years old

*** Better ways of printing strings -- =.format()=

To be more explicit and clear with which values go where in the string, we can name
them by putting some same into the ={}= tokens. When we call the =.format()= function, we
then use the same name as named parameters.

#+begin_src python
name = "Jane"
age = 35

print("{the_name} is {the_age} years old".format(the_name=name,
                                                 the_age=age))
#+end_src

#+RESULTS:
: Results: 
: # => Jane is 35 years old

*** Better ways of printing strings -- alignment

=.format()= allows us to some quite complicated things with the display of
strings. Take this for example where we are setting the alignment of the values.

The syntax of formatting strings can be a language of it's own right! So we won't go
too deep into it here. However, you can find all you need to know about formatting
here: https://docs.python.org/3/library/string.html#format-string-syntax

#+begin_src python
print("|{:<10}|{:^10}|{:>10}|".format('all','dogs','bark'))
print("-" * 34)
#+end_src

#+RESULTS:
: Results: 
: # => |all       |   dogs   |      bark|
: # => ----------------------------------

*** Better ways of printing strings -- =f-strings=

The final method of formatting strings is a newcomer within the language, it is the
so-called =f-string=. Where a =f= character is prefixed to the beginning of the string
you're creating. =f-string='s allow you to use Python syntax within the string (again
delimited by ={}=.

Take this for example where we are referencing the variables =name= and =age= directly.

#+begin_src python
name = "Jane"
age = 35

print(f"{name} is {age} years old")
#+end_src

#+RESULTS:
: Results: 
: # => Jane is 35 years old

