2022-2023/Programming Level-up/week-2/lecture.html
# =&gt; Pi to 3 digits is: 3.142
</pre>
</div>
</div>

<div id="outline-container-org18e1c4b" class="outline-4">
<h4 id="org18e1c4b"><span class="section-number-4">2.4.5.</span> Better ways of printing strings &#x2013; floating points</h4>
<div class="outline-text-4" id="text-2-4-5">
<p>
In the previous example, we used <code>.3</code> to specify 3 decimal places. If we put a number
before the decimal, like <code>10.3</code> we are telling Python <i>make this float occupy 10 spaces
and this float should have 3 decimal places printed</i>.  When it gets printed, you will
notice that it shifts to the right, it gets padded by space. If we use a negative
number in front of the decimal place, we are telling python to shift it to the left.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">print</span>(<span style="color: #8b2252;">"Pi to 3 digits is: %10.3f"</span> % 3.1415926535)
<span style="color: #a020f0;">print</span>(<span style="color: #8b2252;">"Pi to 3 digits is: %-10.3f"</span> % 3.1415926535)
</pre>
</div>

<pre class="example">
Results: 
# =&gt; Pi to 3 digits is:      3.142
# =&gt; Pi to 3 digits is: 3.142
</pre>
</div>
</div>

<div id="outline-container-org51494b6" class="outline-4">
<h4 id="org51494b6"><span class="section-number-4">2.4.6.</span> Quick Exercise &#x2013; printing with <code>%</code></h4>
<div class="outline-text-4" id="text-2-4-6">
<ul class="org-ul">
<li>Creating a dictionary containing the following information:</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-right">Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">name</td>
<td class="org-right">Jane</td>
</tr>

<tr>
<td class="org-left">age</td>
<td class="org-right">35</td>
</tr>

<tr>
<td class="org-left">lon</td>
<td class="org-right">-3.52352</td>
</tr>

<tr>
<td class="org-left">lat</td>
<td class="org-right">2.25222</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Print (using the <code>%</code> operator) the values of this dictionary so that the result looks
like: "Jane (located at -3.5, 2.2) is 35 years old"</li>
</ul>
</div>
</div>

<div id="outline-container-org0b09d26" class="outline-4">
<h4 id="org0b09d26"><span class="section-number-4">2.4.7.</span> Better ways of printing strings &#x2013; <code>.format()</code></h4>
<div class="outline-text-4" id="text-2-4-7">
<p>
Another way of performing 'string interpolation' where the values associated with
variables are printed with strings is accomplished using the <code>.format()</code> method.
</p>

<p>
To use this method, create a string with <code>{}</code> delimiters, and after the string, call
the <code>.format()</code> method, where the arguments to this method are the values you want to
include in the string. The number of values passed to <code>.format()</code> should be the same as
the number of <code>{}</code> in the string.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">name</span> = <span style="color: #8b2252;">"Jane"</span>
<span style="color: #a0522d;">age</span> = 35

<span style="color: #a020f0;">print</span>(<span style="color: #8b2252;">"{} is {} years old"</span>.<span style="color: #483d8b;">format</span>(name, age))
</pre>
</div>

<pre class="example">
Results: 
# =&gt; Jane is 35 years old
</pre>
</div>
</div>

<div id="outline-container-org49d567a" class="outline-4">
<h4 id="org49d567a"><span class="section-number-4">2.4.8.</span> Better ways of printing strings &#x2013; <code>.format()</code></h4>
<div class="outline-text-4" id="text-2-4-8">
<p>
To be more explicit and clear with which values go where in the string, we can name
them by putting some same into the <code>{}</code> tokens. When we call the <code>.format()</code> function, we
then use the same name as named parameters.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">name</span> = <span style="color: #8b2252;">"Jane"</span>
<span style="color: #a0522d;">age</span> = 35

<span style="color: #a020f0;">print</span>(<span style="color: #8b2252;">"{the_name} is {the_age} years old"</span>.<span style="color: #483d8b;">format</span>(the_name=name,
                                                 the_age=age))
</pre>
</div>

<pre class="example">
Results: 
# =&gt; Jane is 35 years old
</pre>
</div>
</div>

<div id="outline-container-org2ab8ff2" class="outline-4">
<h4 id="org2ab8ff2"><span class="section-number-4">2.4.9.</span> Better ways of printing strings &#x2013; alignment</h4>
<div class="outline-text-4" id="text-2-4-9">
<p>
<code>.format()</code> allows us to some quite complicated things with the display of
strings. Take this for example where we are setting the alignment of the values.
</p>

<p>
The syntax of formatting strings can be a language of it's own right! So we won't go
too deep into it here. However, you can find all you need to know about formatting
here: <a href="https://docs.python.org/3/library/string.html#format-string-syntax">https://docs.python.org/3/library/string.html#format-string-syntax</a>
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">print</span>(<span style="color: #8b2252;">"|{:&lt;10}|{:^10}|{:&gt;10}|"</span>.<span style="color: #483d8b;">format</span>(<span style="color: #8b2252;">'all'</span>,<span style="color: #8b2252;">'dogs'</span>,<span style="color: #8b2252;">'bark'</span>))
<span style="color: #a020f0;">print</span>(<span style="color: #8b2252;">"-"</span> * 34)
</pre>
</div>

<pre class="example">
Results: 
# =&gt; |all       |   dogs   |      bark|
# =&gt; ----------------------------------
</pre>
</div>
</div>

<div id="outline-container-org5d91607" class="outline-4">
<h4 id="org5d91607"><span class="section-number-4">2.4.10.</span> Better ways of printing strings &#x2013; <code>f-strings</code></h4>
<div class="outline-text-4" id="text-2-4-10">
<p>
The final method of formatting strings is a newcomer within the language, it is the
so-called <code>f-string</code>. Where a <code>f</code> character is prefixed to the beginning of the string
you're creating. <code>f-string</code>'s allow you to use Python syntax within the string (again
delimited by <code>{}</code>.
</p>

<p>
Take this for example where we are referencing the variables <code>name</code> and <code>age</code> directly.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">name</span> = <span style="color: #8b2252;">"Jane"</span>
<span style="color: #a0522d;">age</span> = 35

<span style="color: #a020f0;">print</span>(f<span style="color: #8b2252;">"{name} is {age} years old"</span>)
</pre>
</div>

<pre class="example">
Results: 
