2022-2023/Programming Level-up/week-2/lecture.tex
# => Pi to 3 digits is: 3.142
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org2fc0171},fragile]{Better ways of printing strings -- floating points}
 In the previous example, we used \texttt{.3} to specify 3 decimal places. If we put a number
before the decimal, like \texttt{10.3} we are telling Python \emph{make this float occupy 10 spaces
and this float should have 3 decimal places printed}.  When it gets printed, you will
notice that it shifts to the right, it gets padded by space. If we use a negative
number in front of the decimal place, we are telling python to shift it to the left.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
print("Pi to 3 digits is: %10.3f" % 3.1415926535)
print("Pi to 3 digits is: %-10.3f" % 3.1415926535)
\end{minted}

\begin{verbatim}
Results: 
# => Pi to 3 digits is:      3.142
# => Pi to 3 digits is: 3.142
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org75dc67c},fragile]{Quick Exercise -- printing with \texttt{\%}}
 \begin{itemize}
\item Creating a dictionary containing the following information:
\end{itemize}

\begin{center}
\begin{tabular}{lr}
Key & Value\\
\hline
name & Jane\\
age & 35\\
lon & -3.52352\\
lat & 2.25222\\
\end{tabular}
\end{center}

\begin{itemize}
\item Print (using the \texttt{\%} operator) the values of this dictionary so that the result looks
like: "Jane (located at -3.5, 2.2) is 35 years old"
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org598c8ae},fragile]{Better ways of printing strings -- \texttt{.format()}}
 Another way of performing 'string interpolation' where the values associated with
variables are printed with strings is accomplished using the \texttt{.format()} method.

To use this method, create a string with \texttt{\{\}} delimiters, and after the string, call
the \texttt{.format()} method, where the arguments to this method are the values you want to
include in the string. The number of values passed to \texttt{.format()} should be the same as
the number of \texttt{\{\}} in the string.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
name = "Jane"
age = 35

print("{} is {} years old".format(name, age))
\end{minted}

\begin{verbatim}
Results: 
# => Jane is 35 years old
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:orgf926d1f},fragile]{Better ways of printing strings -- \texttt{.format()}}
 To be more explicit and clear with which values go where in the string, we can name
them by putting some same into the \texttt{\{\}} tokens. When we call the \texttt{.format()} function, we
then use the same name as named parameters.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
name = "Jane"
age = 35

print("{the_name} is {the_age} years old".format(the_name=name,
						 the_age=age))
\end{minted}

\begin{verbatim}
Results: 
# => Jane is 35 years old
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org31ee4d4},fragile]{Better ways of printing strings -- alignment}
 \texttt{.format()} allows us to some quite complicated things with the display of
strings. Take this for example where we are setting the alignment of the values.

The syntax of formatting strings can be a language of it's own right! So we won't go
too deep into it here. However, you can find all you need to know about formatting
here: \url{https://docs.python.org/3/library/string.html\#format-string-syntax}

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
print("|{:<10}|{:^10}|{:>10}|".format('all','dogs','bark'))
print("-" * 34)
\end{minted}

\begin{verbatim}
Results: 
# => |all       |   dogs   |      bark|
# => ----------------------------------
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org160bdfc},fragile]{Better ways of printing strings -- \texttt{f-strings}}
 The final method of formatting strings is a newcomer within the language, it is the
so-called \texttt{f-string}. Where a \texttt{f} character is prefixed to the beginning of the string
you're creating. \texttt{f-string}'s allow you to use Python syntax within the string (again
delimited by \texttt{\{\}}.

Take this for example where we are referencing the variables \texttt{name} and \texttt{age} directly.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
name = "Jane"
age = 35

print(f"{name} is {age} years old")
\end{minted}

\begin{verbatim}
Results: 
