2021-2022/Programming Level Up/week-2/lecture.org
*** Better ways of printing strings -- =f-strings=

=f-string='s allow you to execute Python code within the string. Here we are accessing
the value from the dictionary by specifying the key within the string itself! It
certainly makes it a lot easier, especially if we only need to access the values for
the string itself.

#+begin_src python
contact_info = {"name": "Jane", "age": 35}

print(f"{contact_info['name']} is {contact_info['age']} years old")
#+end_src

#+RESULTS:
: Results: 
: # => Jane is 35 years old

https://pyformat.info/

*** Better ways of printing strings -- =f-string=

We can still format the values when using =f-string=. The method is similar to those
using the =%f= specifiers.

#+begin_src python
pi = 3.1415926535
print(f"Pi is {pi:.3f} to 3 decimal places")
#+end_src

#+RESULTS:
: Results: 
: # => Pi is 3.142 to 3 decimal places

Many more examples can be found at: https://zetcode.com/python/fstring/

*** Quick Exercise -- printing with =f-string=

- Creating a dictionary containing the following information:

| Key  |    Value |
|------+----------|
| name |     Jane |
| age  |       35 |
| lon  | -3.52352 |
| lat  |  2.25222 |

- Print (using an =f-string=) the values of this dictionary so that the result looks
  like: "Jane (located at -3.5, 2.2) is 35 years old"

*** Operations on strings -- splitting

Apart from formatting, there are plenty more operations we can perform on strings. We
are going to highlight some of the most common here.

The first we're going to look at is splitting a string by a delimiter character using
the =.split()= method. If we don't pass any argument to the =.split()= method, then by
default, it will split by spaces. However, we can change this by specifying the
delimiter.

#+begin_src python
my_string = "This is a sentence, where each word is separated by a space"

print(my_string.split())
print(my_string.split(","))
#+end_src

#+RESULTS:
: Results: 
: # => ['This', 'is', 'a', 'sentence,', 'where', 'each', 'word', 'is', 'separated', 'by', 'a', 'space']
: # => ['This is a sentence', ' where each word is separated by a space']

*** Operations on strings -- joining

As =.split()= splits a single string into a list, =.join()= joins a list of strings into
a single string. To use =.join()=, we first create a string of the delimiter we want to
use to join the list of strings by. In this example we're going to use ="-"=. Then we
call the =.join()= method, passing the list as an argument.

The result is a single string using the delimiter to separate the items of the list.

#+begin_src python
x = ['This', 'is', 'a', 'sentence,', 'where', 'each', 'word', 'is', 'separated', 'by', 'a', 'space']

print("-".join(x))
#+end_src

#+RESULTS:
: Results: 
: # => This-is-a-sentence,-where-each-word-is-separated-by-a-space

