2022-2023/Programming Level-up/week-2/lecture.html
# =&gt; Jane is 35 years old
</pre>
</div>
</div>

<div id="outline-container-orgc650cd3" class="outline-4">
<h4 id="orgc650cd3"><span class="section-number-4">2.4.11.</span> Better ways of printing strings &#x2013; <code>f-strings</code></h4>
<div class="outline-text-4" id="text-2-4-11">
<p>
<code>f-string</code>'s allow you to execute Python code within the string. Here we are accessing
the value from the dictionary by specifying the key within the string itself! It
certainly makes it a lot easier, especially if we only need to access the values for
the string itself.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">contact_info</span> = {<span style="color: #8b2252;">"name"</span>: <span style="color: #8b2252;">"Jane"</span>, <span style="color: #8b2252;">"age"</span>: 35}

<span style="color: #a020f0;">print</span>(f<span style="color: #8b2252;">"{contact_info['name']} is {contact_info['age']} years old"</span>)
</pre>
</div>

<pre class="example">
Results: 
# =&gt; Jane is 35 years old
</pre>


<p>
<a href="https://pyformat.info/">https://pyformat.info/</a>
</p>
</div>
</div>

<div id="outline-container-org747785e" class="outline-4">
<h4 id="org747785e"><span class="section-number-4">2.4.12.</span> Better ways of printing strings &#x2013; <code>f-string</code></h4>
<div class="outline-text-4" id="text-2-4-12">
<p>
We can still format the values when using <code>f-string</code>. The method is similar to those
using the <code>%f</code> specifiers.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">pi</span> = 3.1415926535
<span style="color: #a020f0;">print</span>(f<span style="color: #8b2252;">"Pi is {pi:.3f} to 3 decimal places"</span>)
</pre>
</div>

<pre class="example">
Results: 
# =&gt; Pi is 3.142 to 3 decimal places
</pre>


<p>
Many more examples can be found at: <a href="https://zetcode.com/python/fstring/">https://zetcode.com/python/fstring/</a>
</p>
</div>
</div>

<div id="outline-container-org938a44f" class="outline-4">
<h4 id="org938a44f"><span class="section-number-4">2.4.13.</span> Quick Exercise &#x2013; printing with <code>f-string</code></h4>
<div class="outline-text-4" id="text-2-4-13">
<ul class="org-ul">
<li>Creating a dictionary containing the following information:</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-right">Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">name</td>
<td class="org-right">Jane</td>
</tr>

<tr>
<td class="org-left">age</td>
<td class="org-right">35</td>
</tr>

<tr>
<td class="org-left">lon</td>
<td class="org-right">-3.52352</td>
</tr>

<tr>
<td class="org-left">lat</td>
<td class="org-right">2.25222</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Print (using an <code>f-string</code>) the values of this dictionary so that the result looks
like: "Jane (located at -3.5, 2.2) is 35 years old"</li>
</ul>
</div>
</div>

<div id="outline-container-org0eb33ad" class="outline-4">
<h4 id="org0eb33ad"><span class="section-number-4">2.4.14.</span> Operations on strings &#x2013; splitting</h4>
<div class="outline-text-4" id="text-2-4-14">
<p>
Apart from formatting, there are plenty more operations we can perform on strings. We
are going to highlight some of the most common here.
</p>

<p>
The first we're going to look at is splitting a string by a delimiter character using
the <code>.split()</code> method. If we don't pass any argument to the <code>.split()</code> method, then by
default, it will split by spaces. However, we can change this by specifying the
delimiter.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">my_string</span> = <span style="color: #8b2252;">"This is a sentence, where each word is separated by a space"</span>

<span style="color: #a020f0;">print</span>(my_string.split())
<span style="color: #a020f0;">print</span>(my_string.split(<span style="color: #8b2252;">","</span>))
</pre>
</div>

<pre class="example">
Results: 
# =&gt; ['This', 'is', 'a', 'sentence,', 'where', 'each', 'word', 'is', 'separated', 'by', 'a', 'space']
# =&gt; ['This is a sentence', ' where each word is separated by a space']
</pre>
</div>
</div>

<div id="outline-container-orgc96f3cd" class="outline-4">
<h4 id="orgc96f3cd"><span class="section-number-4">2.4.15.</span> Operations on strings &#x2013; joining</h4>
<div class="outline-text-4" id="text-2-4-15">
<p>
As <code>.split()</code> splits a single string into a list, <code>.join()</code> joins a list of strings into
a single string. To use <code>.join()</code>, we first create a string of the delimiter we want to
use to join the list of strings by. In this example we're going to use <code>"-"</code>. Then we
call the <code>.join()</code> method, passing the list as an argument.
</p>

<p>
The result is a single string using the delimiter to separate the items of the list.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">x</span> = [<span style="color: #8b2252;">'This'</span>, <span style="color: #8b2252;">'is'</span>, <span style="color: #8b2252;">'a'</span>, <span style="color: #8b2252;">'sentence,'</span>, <span style="color: #8b2252;">'where'</span>, <span style="color: #8b2252;">'each'</span>, <span style="color: #8b2252;">'word'</span>, <span style="color: #8b2252;">'is'</span>, <span style="color: #8b2252;">'separated'</span>, <span style="color: #8b2252;">'by'</span>, <span style="color: #8b2252;">'a'</span>, <span style="color: #8b2252;">'space'</span>]

<span style="color: #a020f0;">print</span>(<span style="color: #8b2252;">"-"</span>.join(x))
</pre>
</div>

<pre class="example">
Results: 
