2022-2023/Programming Level-up/week-2/lecture.tex
# => Jane is 35 years old
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org4e7453a},fragile]{Better ways of printing strings -- \texttt{f-strings}}
 \texttt{f-string}'s allow you to execute Python code within the string. Here we are accessing
the value from the dictionary by specifying the key within the string itself! It
certainly makes it a lot easier, especially if we only need to access the values for
the string itself.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
contact_info = {"name": "Jane", "age": 35}

print(f"{contact_info['name']} is {contact_info['age']} years old")
\end{minted}

\begin{verbatim}
Results: 
# => Jane is 35 years old
\end{verbatim}


\url{https://pyformat.info/}
\end{frame}

\begin{frame}[label={sec:org3469f16},fragile]{Better ways of printing strings -- \texttt{f-string}}
 We can still format the values when using \texttt{f-string}. The method is similar to those
using the \texttt{\%f} specifiers.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
pi = 3.1415926535
print(f"Pi is {pi:.3f} to 3 decimal places")
\end{minted}

\begin{verbatim}
Results: 
# => Pi is 3.142 to 3 decimal places
\end{verbatim}


Many more examples can be found at: \url{https://zetcode.com/python/fstring/}
\end{frame}

\begin{frame}[label={sec:orgd1df163},fragile]{Quick Exercise -- printing with \texttt{f-string}}
 \begin{itemize}
\item Creating a dictionary containing the following information:
\end{itemize}

\begin{center}
\begin{tabular}{lr}
Key & Value\\
\hline
name & Jane\\
age & 35\\
lon & -3.52352\\
lat & 2.25222\\
\end{tabular}
\end{center}

\begin{itemize}
\item Print (using an \texttt{f-string}) the values of this dictionary so that the result looks
like: "Jane (located at -3.5, 2.2) is 35 years old"
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org46a2e6c},fragile]{Operations on strings -- splitting}
 Apart from formatting, there are plenty more operations we can perform on strings. We
are going to highlight some of the most common here.

The first we're going to look at is splitting a string by a delimiter character using
the \texttt{.split()} method. If we don't pass any argument to the \texttt{.split()} method, then by
default, it will split by spaces. However, we can change this by specifying the
delimiter.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
my_string = "This is a sentence, where each word is separated by a space"

print(my_string.split())
print(my_string.split(","))
\end{minted}

\begin{verbatim}
Results: 
# => ['This', 'is', 'a', 'sentence,', 'where', 'each', 'word', 'is', 'separated', 'by', 'a', 'space']
# => ['This is a sentence', ' where each word is separated by a space']
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org61d6765},fragile]{Operations on strings -- joining}
 As \texttt{.split()} splits a single string into a list, \texttt{.join()} joins a list of strings into
a single string. To use \texttt{.join()}, we first create a string of the delimiter we want to
use to join the list of strings by. In this example we're going to use \texttt{"-"}. Then we
call the \texttt{.join()} method, passing the list as an argument.

The result is a single string using the delimiter to separate the items of the list.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
x = ['This', 'is', 'a', 'sentence,', 'where', 'each', 'word', 'is', 'separated', 'by', 'a', 'space']

print("-".join(x))
\end{minted}

\begin{verbatim}
Results: 
