2021-2022/Programming Level Up/week-2/lecture.org
*** Operations on strings -- changing case

Other common operations on strings involve change the case. For example:

- Make the entire string uppercase or lowercase
- Making the string title case (every where starts with a capital letter).
- Stripping the string by removing any empty spaces either side of the string.

*Note* we can chain many methods together by doing =.method_1().method_2()=, but only if they
return string. If they return =None=, then chaining will not work.

#+begin_src python
x = "    this String Can change case"

print(x.upper())
print(x.lower())
print(x.title())
print(x.strip())
print(x.strip().title())
#+end_src

#+RESULTS:
: Results: 
: # =>     THIS STRING CAN CHANGE CASE
: # =>     this string can change case
: # =>     This String Can Change Case
: # => this String Can change case
: # => This String Can Change Case

*** Operations on strings -- replacing strings

To replace a substring, we use the =.replace()= method. The first argument is the old
string you want to replace. The second argument is what you want to replace it with.

#+begin_src python
x = "This is a string that contains some text"

print(x.replace("contains some", "definitely contains some"))
#+end_src

#+RESULTS:
: Results: 
: # => This is a string that definitely contains some text

*** Operations on strings -- does it contain a substring?

We can check if a string exists within another string using the =in= keyword. This
returns a Boolean value, so we can use it as a condition to an =if= statement.

#+begin_src python
x = "This is a string that contains some text"

if "text" in x:
    print("It exists")
#+end_src

#+RESULTS:
: Results: 
: # => It exists

* OOP
** Classes

*** Introduction to classes

A class is some representation (can be abstract) of an object. Classes can be used to
create some kind of structure that can be manipulated and changed, just like the ways
you've seen with lists, dictionaries, etc.

Classes allow us to perform Object-oriented Programming (OOP), where we represent
concepts by classes.

But to properly understand how classes work, and why we would want to use them, we
should take a look at some examples.

*** Basic syntax

We're going to start off with the very basic syntax, and build up some more complex
classes.

To create a class, we use the =class= keyword, and give our new class a name. This
introduces a new scope in Python, the scope of the class.

Typically, the first thing we shall see in the class is the =__init__= function.

#+begin_src python
class <name_of_class>:
    def __init__(self, args*):
        <body>
#+end_src

*** Init method

The =__init__= function is a function that gets called automatically as soon as a class
is made. This init function can take many arguments, but must always start with a
=self=.

In this example, we are creating a class that represents an x, y coordinate. We've
called this class =Coordinate=, and we've defined our init function to take an x and y
values when the class is being created.

*Note* its more typical to use titlecase when specifying the class name. So when
reading code its easy to see when you're creating a class versus calling a
function. You should use this style.

#+begin_src python
class Coordinate:
    def __init__(self, x, y):
        self.x = x
        self.y = y
#+end_src

