2022-2023/Programming Level-up/week-2/lecture.html
# =&gt; This-is-a-sentence,-where-each-word-is-separated-by-a-space
</pre>
</div>
</div>

<div id="outline-container-org84e299e" class="outline-4">
<h4 id="org84e299e"><span class="section-number-4">2.4.16.</span> Operations on strings &#x2013; changing case</h4>
<div class="outline-text-4" id="text-2-4-16">
<p>
Other common operations on strings involve change the case. For example:
</p>

<ul class="org-ul">
<li>Make the entire string uppercase or lowercase</li>
<li>Making the string title case (every where starts with a capital letter).</li>
<li>Stripping the string by removing any empty spaces either side of the string.</li>
</ul>

<p>
<b>Note</b> we can chain many methods together by doing <code>.method_1().method_2()</code>, but only if they
return string. If they return <code>None</code>, then chaining will not work.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">x</span> = <span style="color: #8b2252;">"    this String Can change case"</span>

<span style="color: #a020f0;">print</span>(x.upper())
<span style="color: #a020f0;">print</span>(x.lower())
<span style="color: #a020f0;">print</span>(x.title())
<span style="color: #a020f0;">print</span>(x.strip())
<span style="color: #a020f0;">print</span>(x.strip().title())
</pre>
</div>

<pre class="example">
Results: 
# =&gt;     THIS STRING CAN CHANGE CASE
# =&gt;     this string can change case
# =&gt;     This String Can Change Case
# =&gt; this String Can change case
# =&gt; This String Can Change Case
</pre>
</div>
</div>

<div id="outline-container-orgf62a3e0" class="outline-4">
<h4 id="orgf62a3e0"><span class="section-number-4">2.4.17.</span> Operations on strings &#x2013; replacing strings</h4>
<div class="outline-text-4" id="text-2-4-17">
<p>
To replace a substring, we use the <code>.replace()</code> method. The first argument is the old
string you want to replace. The second argument is what you want to replace it with.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">x</span> = <span style="color: #8b2252;">"This is a string that contains some text"</span>

<span style="color: #a020f0;">print</span>(x.replace(<span style="color: #8b2252;">"contains some"</span>, <span style="color: #8b2252;">"definitely contains some"</span>))
</pre>
</div>

<pre class="example">
Results: 
# =&gt; This is a string that definitely contains some text
</pre>
</div>
</div>

<div id="outline-container-org9c702dc" class="outline-4">
<h4 id="org9c702dc"><span class="section-number-4">2.4.18.</span> Operations on strings &#x2013; does it contain a substring?</h4>
<div class="outline-text-4" id="text-2-4-18">
<p>
We can check if a string exists within another string using the <code>in</code> keyword. This
returns a Boolean value, so we can use it as a condition to an <code>if</code> statement.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">x</span> = <span style="color: #8b2252;">"This is a string that contains some text"</span>

<span style="color: #a020f0;">if</span> <span style="color: #8b2252;">"text"</span> <span style="color: #a020f0;">in</span> x:
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">print</span>(<span style="color: #8b2252;">"It exists"</span>)
</pre>
</div>

<pre class="example">
Results: 
# =&gt; It exists
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8097a01" class="outline-2">
<h2 id="org8097a01"><span class="section-number-2">3.</span> OOP</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgebaf236" class="outline-3">
<h3 id="orgebaf236"><span class="section-number-3">3.1.</span> Classes</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orgee62e64" class="outline-4">
<h4 id="orgee62e64"><span class="section-number-4">3.1.1.</span> Introduction to classes</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
A class is some representation (can be abstract) of an object. Classes can be used to
create some kind of structure that can be manipulated and changed, just like the ways
you've seen with lists, dictionaries, etc.
</p>

<p>
Classes allow us to perform Object-oriented Programming (OOP), where we represent
concepts by classes.
</p>

<p>
But to properly understand how classes work, and why we would want to use them, we
should take a look at some examples.
</p>
</div>
</div>

<div id="outline-container-org3a071c8" class="outline-4">
<h4 id="org3a071c8"><span class="section-number-4">3.1.2.</span> Basic syntax</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
We're going to start off with the very basic syntax, and build up some more complex
classes.
</p>

<p>
To create a class, we use the <code>class</code> keyword, and give our new class a name. This
introduces a new scope in Python, the scope of the class.
</p>

<p>
Typically, the first thing we shall see in the class is the <code>__init__</code> function.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">class</span> &lt;name_of_class&gt;:
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">__init__</span>(<span style="color: #a020f0;">self</span>, args*):
        &lt;body&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org4fb8c84" class="outline-4">
<h4 id="org4fb8c84"><span class="section-number-4">3.1.3.</span> Init method</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
The <code>__init__</code> function is a function that gets called automatically as soon as a class
is made. This init function can take many arguments, but must always start with a
<code>self</code>.
</p>

<p>
In this example, we are creating a class that represents an x, y coordinate. We've
called this class <code>Coordinate</code>, and we've defined our init function to take an x and y
values when the class is being created.
</p>

<p>
<b>Note</b> its more typical to use titlecase when specifying the class name. So when
reading code its easy to see when you're creating a class versus calling a
function. You should use this style.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">Coordinate</span>:
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">__init__</span>(<span style="color: #a020f0;">self</span>, x, y):
        <span style="color: #a020f0;">self</span>.x = x
        <span style="color: #a020f0;">self</span>.y = y
</pre>
</div>
</div>
</div>
