2022-2023/Programming Level-up/week-2/lecture.tex
# => This-is-a-sentence,-where-each-word-is-separated-by-a-space
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:orgdf44a6a},fragile]{Operations on strings -- changing case}
 Other common operations on strings involve change the case. For example:

\begin{itemize}
\item Make the entire string uppercase or lowercase
\item Making the string title case (every where starts with a capital letter).
\item Stripping the string by removing any empty spaces either side of the string.
\end{itemize}

\alert{Note} we can chain many methods together by doing \texttt{.method\_1().method\_2()}, but only if they
return string. If they return \texttt{None}, then chaining will not work.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
x = "    this String Can change case"

print(x.upper())
print(x.lower())
print(x.title())
print(x.strip())
print(x.strip().title())
\end{minted}

\begin{verbatim}
Results: 
# =>     THIS STRING CAN CHANGE CASE
# =>     this string can change case
# =>     This String Can Change Case
# => this String Can change case
# => This String Can Change Case
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org2edea42},fragile]{Operations on strings -- replacing strings}
 To replace a substring, we use the \texttt{.replace()} method. The first argument is the old
string you want to replace. The second argument is what you want to replace it with.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
x = "This is a string that contains some text"

print(x.replace("contains some", "definitely contains some"))
\end{minted}

\begin{verbatim}
Results: 
# => This is a string that definitely contains some text
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org8abc3c6},fragile]{Operations on strings -- does it contain a substring?}
 We can check if a string exists within another string using the \texttt{in} keyword. This
returns a Boolean value, so we can use it as a condition to an \texttt{if} statement.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
x = "This is a string that contains some text"

if "text" in x:
    print("It exists")
\end{minted}

\begin{verbatim}
Results: 
# => It exists
\end{verbatim}
\end{frame}

\section{OOP}
\label{sec:org8b37cdc}
\subsection{Classes}
\label{sec:orgd3faa2b}

\begin{frame}[label={sec:org2bd2349}]{Introduction to classes}
A class is some representation (can be abstract) of an object. Classes can be used to
create some kind of structure that can be manipulated and changed, just like the ways
you've seen with lists, dictionaries, etc.

Classes allow us to perform Object-oriented Programming (OOP), where we represent
concepts by classes.

But to properly understand how classes work, and why we would want to use them, we
should take a look at some examples.
\end{frame}

\begin{frame}[label={sec:org5b77321},fragile]{Basic syntax}
 We're going to start off with the very basic syntax, and build up some more complex
classes.

To create a class, we use the \texttt{class} keyword, and give our new class a name. This
introduces a new scope in Python, the scope of the class.

Typically, the first thing we shall see in the class is the \texttt{\_\_init\_\_} function.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
class <name_of_class>:
    def __init__(self, args*):
	<body>
\end{minted}
\end{frame}

\begin{frame}[label={sec:orgc9ff9ac},fragile]{Init method}
 The \texttt{\_\_init\_\_} function is a function that gets called automatically as soon as a class
is made. This init function can take many arguments, but must always start with a
\texttt{self}.

In this example, we are creating a class that represents an x, y coordinate. We've
called this class \texttt{Coordinate}, and we've defined our init function to take an x and y
values when the class is being created.

\alert{Note} its more typical to use titlecase when specifying the class name. So when
reading code its easy to see when you're creating a class versus calling a
function. You should use this style.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
class Coordinate:
    def __init__(self, x, y):
	self.x = x
	self.y = y
\end{minted}
\end{frame}
