2021-2022/Programming Level Up/week-2/lecture.org
*** Instantiating

To create an /instance/ of this class, call the name of the class as you would a
function, and pass any parameters you've defined in the init function.

In this example, we are creating a new vector using =Vector(...)= and we're passing the
x and y coordinate.

#+begin_src python
class Vector:
    def __init__(self, x, y):
        self.x = x
        self.y = y


point_1 = Vector(5, 2)
#+end_src

*** Class variables

In the previous example, we've been creating a class variables by using
=self.<variable_name>=. This is telling Python /this class should have a variable of
this name/.

It allows then to reference the variable when working with the class.

#+begin_src python
class Vector:
    def __init__(self, x, y):
        self.x = x
        self.y = y
        self.length = self.x + self.y

point_1 = Vector(5, 2)
print(point_1.x)
print(point_1.y)
print(point_1.length)
#+end_src

#+RESULTS:
: Results: 
: # => 5
: # => 2
: # => 7

*** Class Methods

A class can have many methods associated with it. To create a new method, we create a
function within the scope of the class, remember that the first parameter of the
function should be =self=.

Even in these functions, we can refer to our =self.x= and =self.y= within this new
function.

You'll notice that to call this function, we using the =.length()= method similar to
how we've worked with strings/lists/etc. This is because in Python, everything is an
object!

#+begin_src python
class Vector:
    def __init__(self, x, y):
        self.x = x
        self.y = y

    def length(self):
        return self.x + self.y


my_point = Vector(2, 5)
print(my_point.length())
#+end_src

#+RESULTS:
: Results: 
: # => 7

*** dunder-methods

While we could, for example, create a function called =.print()=, sometimes we would
like to use the in built functions like =print()=. When creating a class, there is a
set of /dunder-methods/ (double-under to reference the two '=__=' characters either side
of the function name).

One of these dunder-methods is =__repr__=, which allows us to specify how the object
looks when its printed.

*** dunder-methods

#+begin_src python
class OldVector:
    def __init__(self, x, y):
        self.x = x
        self.y = y

print(OldVector(2, 5))

class Vector:
    def __init__(self, x, y):
        self.x = x
        self.y = y

    def __repr__(self):
        return f"Vector({self.x}, {self.y})"

print(Vector(2, 5))
#+end_src

#+RESULTS:
: Results: 
: # => <__main__.OldVector object at 0x7f658721e250>
: # => Vector(2, 5)

*** dunder-methods

There are many more dunder-methods you should know when creating classes. We shall go through:

- =__len__= -- specify how the length of the class should be computed.
- =__getitem__= -- how to index over the class
- =__call__= -- how to use the class like a function
- =__iter__= -- what to do when iteration starts
- =__next__= -- what to do at the next step of the iteration

