2022-2023/Programming Level-up/week-2/lecture.html

<div id="outline-container-org20ede27" class="outline-4">
<h4 id="org20ede27"><span class="section-number-4">3.1.4.</span> Instantiating</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
To create an <i>instance</i> of this class, call the name of the class as you would a
function, and pass any parameters you've defined in the init function.
</p>

<p>
In this example, we are creating a new vector using <code>Vector(...)</code> and we're passing the
x and y coordinate.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">Vector</span>:
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">__init__</span>(<span style="color: #a020f0;">self</span>, x, y):
        <span style="color: #a020f0;">self</span>.x = x
        <span style="color: #a020f0;">self</span>.y = y


<span style="color: #a0522d;">point_1</span> = Vector(5, 2)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf43c925" class="outline-4">
<h4 id="orgf43c925"><span class="section-number-4">3.1.5.</span> Class variables</h4>
<div class="outline-text-4" id="text-3-1-5">
<p>
In the previous example, we've been creating a class variables by using
<code>self.&lt;variable_name&gt;</code>. This is telling Python <i>this class should have a variable of
this name</i>.
</p>

<p>
It allows then to reference the variable when working with the class.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">Vector</span>:
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">__init__</span>(<span style="color: #a020f0;">self</span>, x, y):
        <span style="color: #a020f0;">self</span>.x = x
        <span style="color: #a020f0;">self</span>.y = y
        <span style="color: #a020f0;">self</span>.length = <span style="color: #a020f0;">self</span>.x + <span style="color: #a020f0;">self</span>.y

<span style="color: #a0522d;">point_1</span> = Vector(5, 2)
<span style="color: #a020f0;">print</span>(point_1.x)
<span style="color: #a020f0;">print</span>(point_1.y)
<span style="color: #a020f0;">print</span>(point_1.length)
</pre>
</div>

<pre class="example">
Results: 
# =&gt; 5
# =&gt; 2
# =&gt; 7
</pre>
</div>
</div>

<div id="outline-container-org86edd2f" class="outline-4">
<h4 id="org86edd2f"><span class="section-number-4">3.1.6.</span> Class Methods</h4>
<div class="outline-text-4" id="text-3-1-6">
<p>
A class can have many methods associated with it. To create a new method, we create a
function within the scope of the class, remember that the first parameter of the
function should be <code>self</code>.
</p>

<p>
Even in these functions, we can refer to our <code>self.x</code> and <code>self.y</code> within this new
function.
</p>

<p>
You'll notice that to call this function, we using the <code>.length()</code> method similar to
how we've worked with strings/lists/etc. This is because in Python, everything is an
object!
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">Vector</span>:
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">__init__</span>(<span style="color: #a020f0;">self</span>, x, y):
        <span style="color: #a020f0;">self</span>.x = x
        <span style="color: #a020f0;">self</span>.y = y

<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">length</span>(<span style="color: #a020f0;">self</span>):
        <span style="color: #a020f0;">return</span> <span style="color: #a020f0;">self</span>.x + <span style="color: #a020f0;">self</span>.y


<span style="color: #a0522d;">my_point</span> = Vector(2, 5)
<span style="color: #a020f0;">print</span>(my_point.length())
</pre>
</div>

<pre class="example">
Results: 
# =&gt; 7
</pre>
</div>
</div>

<div id="outline-container-orgca9a11b" class="outline-4">
<h4 id="orgca9a11b"><span class="section-number-4">3.1.7.</span> dunder-methods</h4>
<div class="outline-text-4" id="text-3-1-7">
<p>
While we could, for example, create a function called <code>.print()</code>, sometimes we would
like to use the in built functions like <code>print()</code>. When creating a class, there is a
set of <i>dunder-methods</i> (double-under to reference the two '<code>__</code>' characters either side
of the function name).
</p>

<p>
One of these dunder-methods is <code>__repr__</code>, which allows us to specify how the object
looks when its printed.
</p>
</div>
</div>

<div id="outline-container-org887cee8" class="outline-4">
<h4 id="org887cee8"><span class="section-number-4">3.1.8.</span> dunder-methods</h4>
<div class="outline-text-4" id="text-3-1-8">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">OldVector</span>:
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">__init__</span>(<span style="color: #a020f0;">self</span>, x, y):
        <span style="color: #a020f0;">self</span>.x = x
        <span style="color: #a020f0;">self</span>.y = y

<span style="color: #a020f0;">print</span>(OldVector(2, 5))

<span style="color: #a020f0;">class</span> <span style="color: #228b22;">Vector</span>:
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">__init__</span>(<span style="color: #a020f0;">self</span>, x, y):
        <span style="color: #a020f0;">self</span>.x = x
        <span style="color: #a020f0;">self</span>.y = y

<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">__repr__</span>(<span style="color: #a020f0;">self</span>):
        <span style="color: #a020f0;">return</span> f<span style="color: #8b2252;">"Vector({self.x}, {self.y})"</span>

<span style="color: #a020f0;">print</span>(Vector(2, 5))
</pre>
</div>

<pre class="example">
Results: 
# =&gt; &lt;__main__.OldVector object at 0x7f658721e250&gt;
# =&gt; Vector(2, 5)
</pre>
</div>
</div>

<div id="outline-container-org8c0fe87" class="outline-4">
<h4 id="org8c0fe87"><span class="section-number-4">3.1.9.</span> dunder-methods</h4>
<div class="outline-text-4" id="text-3-1-9">
<p>
There are many more dunder-methods you should know when creating classes. We shall go through:
</p>

<ul class="org-ul">
<li><code>__len__</code> &#x2013; specify how the length of the class should be computed.</li>
<li><code>__getitem__</code> &#x2013; how to index over the class</li>
<li><code>__call__</code> &#x2013; how to use the class like a function</li>
<li><code>__iter__</code> &#x2013; what to do when iteration starts</li>
<li><code>__next__</code> &#x2013; what to do at the next step of the iteration</li>
</ul>
</div>
</div>
