2022-2023/Programming Level-up/week-2/lecture.tex

\begin{frame}[label={sec:orge903ad1},fragile]{Instantiating}
 To create an \emph{instance} of this class, call the name of the class as you would a
function, and pass any parameters you've defined in the init function.

In this example, we are creating a new vector using \texttt{Vector(...)} and we're passing the
x and y coordinate.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
class Vector:
    def __init__(self, x, y):
	self.x = x
	self.y = y


point_1 = Vector(5, 2)
\end{minted}
\end{frame}

\begin{frame}[label={sec:org991d30a},fragile]{Class variables}
 In the previous example, we've been creating a class variables by using
\texttt{self.<variable\_name>}. This is telling Python \emph{this class should have a variable of
this name}.

It allows then to reference the variable when working with the class.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
class Vector:
    def __init__(self, x, y):
	self.x = x
	self.y = y
	self.length = self.x + self.y

point_1 = Vector(5, 2)
print(point_1.x)
print(point_1.y)
print(point_1.length)
\end{minted}

\begin{verbatim}
Results: 
# => 5
# => 2
# => 7
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:orgec1535d},fragile]{Class Methods}
 A class can have many methods associated with it. To create a new method, we create a
function within the scope of the class, remember that the first parameter of the
function should be \texttt{self}.

Even in these functions, we can refer to our \texttt{self.x} and \texttt{self.y} within this new
function.

You'll notice that to call this function, we using the \texttt{.length()} method similar to
how we've worked with strings/lists/etc. This is because in Python, everything is an
object!

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
class Vector:
    def __init__(self, x, y):
	self.x = x
	self.y = y

    def length(self):
	return self.x + self.y


my_point = Vector(2, 5)
print(my_point.length())
\end{minted}

\begin{verbatim}
Results: 
# => 7
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org15e374f},fragile]{dunder-methods}
 While we could, for example, create a function called \texttt{.print()}, sometimes we would
like to use the in built functions like \texttt{print()}. When creating a class, there is a
set of \emph{dunder-methods} (double-under to reference the two '\texttt{\_\_}' characters either side
of the function name).

One of these dunder-methods is \texttt{\_\_repr\_\_}, which allows us to specify how the object
looks when its printed.
\end{frame}

\begin{frame}[label={sec:orgf922e11},fragile]{dunder-methods}
 \begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
class OldVector:
    def __init__(self, x, y):
	self.x = x
	self.y = y

print(OldVector(2, 5))

class Vector:
    def __init__(self, x, y):
	self.x = x
	self.y = y

    def __repr__(self):
	return f"Vector({self.x}, {self.y})"

print(Vector(2, 5))
\end{minted}

\begin{verbatim}
Results: 
# => <__main__.OldVector object at 0x7f658721e250>
# => Vector(2, 5)
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org983105c},fragile]{dunder-methods}
 There are many more dunder-methods you should know when creating classes. We shall go through:

\begin{itemize}
\item \texttt{\_\_len\_\_} -- specify how the length of the class should be computed.
\item \texttt{\_\_getitem\_\_} -- how to index over the class
\item \texttt{\_\_call\_\_} -- how to use the class like a function
\item \texttt{\_\_iter\_\_} -- what to do when iteration starts
\item \texttt{\_\_next\_\_} -- what to do at the next step of the iteration
\end{itemize}
\end{frame}
