2022-2023/Programming Level-up/week-2/lecture.html

<div id="outline-container-org42aca6c" class="outline-4">
<h4 id="org42aca6c"><span class="section-number-4">3.1.10.</span> <code>__len__</code></h4>
<div class="outline-text-4" id="text-3-1-10">
<p>
The <code>__len__</code> function allows us to specify how the <code>len()</code> function acts on the
class. Take this hypothetical dataset. We create a <code>__len__</code> function that returns the
length of the unique elements in the dataset.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">Dataset</span>:
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">__init__</span>(<span style="color: #a020f0;">self</span>, data):
        <span style="color: #a020f0;">self</span>.data = data

<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">__len__</span>(<span style="color: #a020f0;">self</span>):
        <span style="color: #8b2252;">"""Return the length of unique elements"""</span>
        <span style="color: #a020f0;">return</span> <span style="color: #483d8b;">len</span>(<span style="color: #483d8b;">set</span>(<span style="color: #a020f0;">self</span>.data))

<span style="color: #a0522d;">data</span> = Dataset([1, 2, 3, 3, 3, 5, 1])
<span style="color: #a020f0;">print</span>(<span style="color: #483d8b;">len</span>(data))
</pre>
</div>

<pre class="example">
Results: 
# =&gt; 4
</pre>
</div>
</div>

<div id="outline-container-org9709ab1" class="outline-4">
<h4 id="org9709ab1"><span class="section-number-4">3.1.11.</span> <code>__getitem__</code></h4>
<div class="outline-text-4" id="text-3-1-11">
<p>
Next <code>__getitem__</code> allows us to index over a class. This new function must include <code>self</code>
and a variable to pass the index. Here I've used <code>idx</code>. In this function I am simply
indexing on the on the classes <code>self.data</code>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">Dataset</span>:
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">__init__</span>(<span style="color: #a020f0;">self</span>, data):
        <span style="color: #a020f0;">self</span>.data = data

<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">__getitem__</span>(<span style="color: #a020f0;">self</span>, idx):
        <span style="color: #a020f0;">return</span> <span style="color: #a020f0;">self</span>.data[idx]

<span style="color: #a0522d;">data</span> = Dataset([1, 2, 3, 3, 3, 5, 1])
<span style="color: #a020f0;">print</span>(data[2])
</pre>
</div>

<pre class="example">
Results: 
# =&gt; 3
</pre>
</div>
</div>

<div id="outline-container-org05599ea" class="outline-4">
<h4 id="org05599ea"><span class="section-number-4">3.1.12.</span> <code>__call__</code></h4>
<div class="outline-text-4" id="text-3-1-12">
<p>
In a small number of cases, it is nice to use the class just like a function. This is
what <code>__call__</code> allows us to do. In this function we specify what should happen when
class is 'called' like a function. In this simple example, we are creating a function
that prints the type of food being used as a parameter to the function.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">Jaguar</span>:
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">__call__</span>(<span style="color: #a020f0;">self</span>, food):
        <span style="color: #a020f0;">print</span>(f<span style="color: #8b2252;">"The jaguar eats the {food}."</span>)

<span style="color: #a0522d;">food</span> = <span style="color: #8b2252;">"apple"</span>
<span style="color: #a0522d;">animal</span> = Jaguar()

animal(food)
</pre>
</div>

<pre class="example">
Results: 
# =&gt; The jaguar eats the apple.
</pre>
</div>
</div>

<div id="outline-container-orge199f00" class="outline-4">
<h4 id="orge199f00"><span class="section-number-4">3.1.13.</span> <code>__iter__</code> and <code>__next__</code></h4>
<div class="outline-text-4" id="text-3-1-13">
<p>
<code>__iter__</code> and <code>__next__</code> allow us to make our class iterable, i.e. we can use it in a
<code>for</code> loop for example.
</p>

<p>
The <code>__iter__</code> function should define what happens when we start the iteration, and
<code>__next__</code> defines what happens at every step of the iteration.
</p>

<p>
Let's take a look at an example where we have an iterable set of prime numbers.
</p>
</div>
</div>

<div id="outline-container-org779ed4b" class="outline-4">
<h4 id="org779ed4b"><span class="section-number-4">3.1.14.</span> <code>__iter__</code> and <code>__next__</code></h4>
<div class="outline-text-4" id="text-3-1-14">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">Primes</span>:
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">__init__</span>(<span style="color: #a020f0;">self</span>):
        <span style="color: #a020f0;">self</span>.primes = [2, 3, 5, 7, 11]

<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">__iter__</span>(<span style="color: #a020f0;">self</span>):
        <span style="color: #a020f0;">self</span>.idx = 0
        <span style="color: #a020f0;">return</span> <span style="color: #a020f0;">self</span>

<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">__len__</span>(<span style="color: #a020f0;">self</span>):
        <span style="color: #a020f0;">return</span> <span style="color: #483d8b;">len</span>(<span style="color: #a020f0;">self</span>.primes)

<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">__next__</span>(<span style="color: #a020f0;">self</span>):
        <span style="color: #a020f0;">if</span> <span style="color: #a020f0;">self</span>.idx &lt; <span style="color: #483d8b;">len</span>(<span style="color: #a020f0;">self</span>):
            <span style="color: #a0522d;">item</span> = <span style="color: #a020f0;">self</span>.primes[<span style="color: #a020f0;">self</span>.idx]
            <span style="color: #a020f0;">self</span>.idx += 1
            <span style="color: #a020f0;">return</span> item
        <span style="color: #a020f0;">else</span>:
            <span style="color: #a020f0;">raise</span> <span style="color: #228b22;">StopIteration</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf3014e1" class="outline-4">
<h4 id="orgf3014e1"><span class="section-number-4">3.1.15.</span> <code>__iter__</code> and <code>__next__</code></h4>
<div class="outline-text-4" id="text-3-1-15">
<p>
And now we can iterate over this class
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">prime_numbers</span> = Primes()

<span style="color: #a020f0;">for</span> prime_number <span style="color: #a020f0;">in</span> prime_numbers:
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">print</span>(prime_number)
</pre>
</div>

<pre class="example">
Results: 
