2022-2023/Programming Level-up/week-2/lecture.tex
# => 2
# => 3
# => 5
# => 7
# => 11
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org7eba47b},fragile]{Inheritance}
 One special thing about OOP is that its normally designed to provide inheritance --
this is true in Python. Inheritance is where you have a base class, and other classes
inherit from this base class. This means that the class that inherits from the base
class has access to the same methods and class variables. In some cases, it can
override some of these features.

Let's take a look an example.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
class Animal:
    def growl(self):
	print("The animal growls")

    def walk(self):
	raise NotImplementError
\end{minted}

Here we have created a simple class called Animal, that has two functions, one of
which will raise an error if its called.
\end{frame}

\begin{frame}[label={sec:orgbe1540f},fragile]{Inheritance}
 We can inherit from this Animal class by placing our base class in \texttt{()} after the new
class name.

Here we are creating two classes, Tiger and Duck. Both of these new classes inherit
from Animal. Also, both of these classes are overriding the walk functions. But they
are not creating a growl method themselves.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
class Tiger(Animal):
    def walk(self):
	print("The Tiger walks through the jungle")

class Duck(Animal):
    def walk(self):
	print("The Duck walks through the jungle")
\end{minted}
\end{frame}

\begin{frame}[label={sec:org372ba81},fragile]{Inheritance}
 Look at what happens when we create instances of these classes, and call the
functions. First we see that the correct method has been called. I.e. for the duck
class, the correct \texttt{walk} method was called.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
first_animal = Tiger()
second_animal = Duck()

first_animal.walk()
second_animal.walk()
\end{minted}

\begin{verbatim}
Results: 
# => The Tiger walks through the jungle
# => The Duck walks through the jungle
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org2fabbe0},fragile]{Inheritance}
 But what happens if we call the \texttt{.growl()} method?

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
first_animal.growl()
second_animal.growl()
\end{minted}

\begin{verbatim}
Results: 
# => The animal growls
# => The animal growls
\end{verbatim}


We see that it still works. Even though both Duck and Tiger didn't create a \texttt{.growl()}
method, it inherited it from the base class Animal. This works for class methods and
class variables.
\end{frame}

\section{Exercise}
\label{sec:org7c01ad5}

\subsection{Exercise}
\label{sec:orgce09ccb}

\begin{frame}[label={sec:org517c442},fragile]{An object based library system}
 We're going to improve on our library system from last lecture. Instead of a
\texttt{functional} style of code, we're going to use a OOP paradigm to create our solution.

Like last time, we're going to create our solution one step at a time.

First, we need to create our class called \texttt{Database}. This database is going to take an
optional parameter in its init function -- the data. If the user specifies data
(represented as a list of dictionaries like last time), then the class will populate
a class variable called data, else this class variable will be set to an empty list.

Summary:
\begin{itemize}
\item Create a class called \texttt{Database}.
\item When creating an instance of \texttt{Database}, the user can optionally specify a list of
dictionaries to initialise the class variable \texttt{data} with. If no data is provided,
this class variable will be initialised to an empty list.
\end{itemize}
\end{frame}
