2022-2023/Programming Level-up/week-2/lecture.tex

\begin{frame}[label={sec:org3234d7f},fragile]{Adding data}
 We will want to include a function to add data to our database.

Create a class method called \texttt{add}, that takes three arguments (in addition to \texttt{self} of
course), the title, the author, and the release date.

This add function adds the new book entry to the end of \texttt{data}. Populate this database
with the following information.

\begin{center}
\begin{tabularx}{\textwidth}{XXX}
Title & Author & Release Date\\
\hline
Moby Dick & Herman Melville & 1851\\
A Study in Scarlet & Sir Arthur Conan Doyle & 1887\\
Frankenstein & Mary Shelley & 1818\\
Hitchhikers Guide to the Galaxy & Douglas Adams & 1879\\
\end{tabularx}
\end{center}
\end{frame}

\begin{frame}[label={sec:org21bf358},fragile]{Locating a book}
 Create a class method called locate by tile that takes the title of the book to look
up, and returns the dictionary of all books that have this title. Unlike last time,
we don't need to pass the \texttt{data} as an argument, as its contained within the class.
\end{frame}

\begin{frame}[label={sec:org2449981},fragile]{Updating our database}
 Create a class method called \texttt{update} that takes 4 arguments:, 1) the key of the value
we want to update 2) the value we want to update it to 3) the key we want to check
to find out if we have the correct book and 4) the value of the key to check if we
have the correct book.

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
db.update(key="release year", value=1979, where_key="title",
	  where_value="Hitchhikers Guide to the Galaxy")
\end{minted}

Use this to fix the release data of the Hitchhiker's book.
\end{frame}

\begin{frame}[label={sec:org01ac451},fragile]{Printed representation}
 Using the \texttt{\_\_str\_\_} dunder-method (this is similar to \texttt{\_\_repr\_\_} as we saw before),
create a function that prints out a formatted representation of the entire database
as a string. Some of the output should look like:

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
Library System
--------------

Entry 1:
- Name: Moby Dick
- Author: Herman Melville
- Release Date: 1851
...
\end{minted}
\end{frame}

\begin{frame}[label={sec:org69ca952},fragile]{Extending our OOP usage}
 So far we've used a list of dictionaries. One issue with this is that there is no
constraints on the keys we can use. This will certainly create problems if certain
keys are missing.

Instead of using dictionaries. We can create another class called \texttt{Book} that will take
three arguments when it is initialised: \texttt{name}, \texttt{author}, and \texttt{release\_date}. The init
function should initialise three class variables to save this information.

Modify the database to, instead of working with a list of dictionaries, work with a
list of Book objects.
\end{frame}

\begin{frame}[label={sec:orga97dc50},fragile]{Printed representation -- challenge.}
 Improve upon the printed representation of the last exercise but instead of bulleted
lists, use formatted tables using \texttt{f-string} formatting
(\url{https://zetcode.com/python/fstring/}).

The output should look like this:

\begin{minted}[frame=lines,linenos=true,firstnumber=last,fontsize=\footnotesize,xleftmargin=15pt,numbersep=8pt]{python}
Library System
--------------

| Name           | Author           | Release Data |
|----------------|------------------|--------------|
| Moby Dick      | Herman Melville  |         1851 |
...
\end{minted}

Notice how Release date is right justified, while Name and Author are left justified.
\end{frame}
\end{document}
